{
  "backend/main.mo": "Main backend actor implementing authorization, user profiles, books, carts, orders, balances, and an async customer support messaging system with admin replies.",
  "backend/migration.mo": "Migration module initializing new support message fields and nextMessageId while preserving existing userProfiles.",
  "feature_evidence.json": "Feature evidence report mapping implemented features to their related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file in the project.",
  "frontend/index.css": "Global Tailwind CSS configuration defining color tokens, themes, and base styling rules.",
  "frontend/index.html": "Base HTML entry point loading the root React app via main.tsx.",
  "frontend/src/App.tsx": "Sets up the main React router, theme provider, and application route tree for all pages.",
  "frontend/src/components/auth/AdminRoute.tsx": "Route guard that restricts access to authenticated admin users and shows appropriate error states.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button integrating with Internet Identity and handling loading and error states.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Dialog prompting new authenticated users to enter and save their profile name.",
  "frontend/src/components/books/BookCard.tsx": "UI card component displaying book metadata, cover image, price, and navigation links.",
  "frontend/src/components/books/CoverImage.tsx": "Renders a book cover image using a fixed generated asset with fallback to an inline SVG placeholder on error.",
  "frontend/src/components/EmptyState.tsx": "Reusable UI component for displaying placeholder or empty content states.",
  "frontend/src/components/layout/Footer.tsx": "Displays footer with social links, customer service chat trigger, and attribution info.",
  "frontend/src/components/layout/Header.tsx": "Shows site navigation, user balance, cart button with item count, and login handling based on authentication state.",
  "frontend/src/components/layout/Layout.tsx": "Wraps the page with header, footer, main content outlet, and profile setup dialog.",
  "frontend/src/components/layout/PageLayout.tsx": "Provides a configurable max‑width container for page content with padding.",
  "frontend/src/components/library/BookContentDialog.tsx": "Modal dialog for displaying purchased book content with loading, error, and empty states.",
  "frontend/src/components/support/CustomerServiceChatDialog.tsx": "Provides a chat dialog for submitting support messages and viewing threaded responses with authentication-aware behavior.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance, updating it when identity changes and invalidating dependent queries.",
  "frontend/src/hooks/useAuthz.ts": "Hooks for fetching and saving the caller's user profile and checking admin status using the actor.",
  "frontend/src/hooks/useBalance.ts": "Hooks for retrieving user token balance and minting new tokens via the actor.",
  "frontend/src/hooks/useBooks.ts": "Hooks to query, add, update, and delete books, with cache invalidation for related book queries.",
  "frontend/src/hooks/useCart.ts": "Hooks for cart CRUD operations, checkout, and deriving cart items with book data and totals.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity authentication using AuthClient, handling login state and stored identities.",
  "frontend/src/hooks/useLibrary.ts": "Builds a user’s library by joining delivered book IDs with all books and fetches purchased book content via actor queries.",
  "frontend/src/hooks/useOrders.ts": "Defines React Query hooks for fetching individual orders, the current user's orders, and all orders using the actor API.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file indicating queries are grouped in feature-specific hooks.",
  "frontend/src/hooks/useSupportChat.ts": "Implements support chat operations including sending messages, fetching user/admin messages, polling responses, and replying as admin.",
  "frontend/src/index.css": "Defines Tailwind base styles and a custom light/dark color palette for the app’s UI theme.",
  "frontend/src/lib/utils.ts": "Exports a utility function that merges class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Initializes the React app, wrapping it in QueryClientProvider and InternetIdentityProvider before rendering App.",
  "frontend/src/pages/admin/AdminCatalogPage.tsx": "Admin interface for listing, adding, editing, and managing books in the catalog.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Top-level admin dashboard with tabs for catalog, orders, minting, and support inbox.",
  "frontend/src/pages/admin/AdminMintPage.tsx": "Admin form for minting GLDT tokens to a specified principal with validation and toast feedback.",
  "frontend/src/pages/admin/AdminOrdersPage.tsx": "Displays all customer orders with IDs, customer principals, item details, totals, and dates using table components.",
  "frontend/src/pages/admin/AdminSupportInboxPage.tsx": "Shows grouped customer support message threads and allows admins to view messages and send replies.",
  "frontend/src/pages/BookDetailsPage.tsx": "Displays book details, price, availability, and allows logged‑in users to add the book to their cart.",
  "frontend/src/pages/CartPage.tsx": "Shows the user's cart with item removal and checkout handling, requiring login to view or proceed.",
  "frontend/src/pages/CatalogPage.tsx": "Lists available books with search filtering and loading states for the catalog view.",
  "frontend/src/pages/CheckoutPage.tsx": "Checkout flow handling cart review, balance validation, and order submission with redirects and error handling.",
  "frontend/src/pages/HomePage.tsx": "Home page showing a hero section and a featured book list fetched from the catalog.",
  "frontend/src/pages/MyLibraryPage.tsx": "Displays the logged-in user's purchased books with options to read content via a dialog.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Shows confirmation details for a completed order, listing purchased items and navigation options.",
  "frontend/src/utils/format.ts": "Provides helpers for formatting token amounts, principals, and timestamps.",
  "frontend/src/utils/orderId.ts": "Generates unique order IDs using timestamps and random numbers.",
  "frontend/src/utils/principal.ts": "Parses and validates principal strings using the ICP SDK.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, persisting, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "TailwindCSS configuration extending colors, fonts, animations, and layout plugins.",
  "project_state.json": "Metadata describing project requirements, existing features, and architectural notes for the e‑commerce app."
}