{
  "backend/main.mo": "Defines the backend canister with user profiles, books, carts, orders, KYC mappings, authorization, and a catalog export method; includes storage and access control mixins.",
  "feature_evidence.json": "Lists feature evidence items with associated files, components, tests, and confidence for rollback, versioning, and UI validation workflows.",
  "frontend-file-summaries.txt": "Provides short descriptions of numerous frontend files including components, pages, and utilities used throughout the app.",
  "frontend/.env.production": "Sets production build environment variables indicating Live mode and version 29.",
  "frontend/docs/deployment-preflight.md": "Explains deployment preflight rules including version‑29 enforcement for Live and the separate rollback workflow for older versions.",
  "frontend/docs/draft-rebuild-v29.md": "Describes how to rebuild Draft Version 29 safely without affecting the Live deployment or backend canister.",
  "frontend/docs/draft-regression-checks.md": "Lists regression checks to verify catalog visibility, book details, error handling, and console stability before promoting a draft.",
  "frontend/docs/live-smoke-test-v22.md": "Provides a detailed smoke‑test checklist for validating that Version 22 functions correctly after publishing to Live.",
  "frontend/docs/live-smoke-test-v29-report-template.md": "Template for recording Version 29 Live smoke test results with structured PASS/FAIL sections and environment details.",
  "frontend/docs/live-smoke-test-v29.md": "Manual checklist for verifying Version 29 on Live, covering environment, catalog, details pages, purchase flow, and admin tests.",
  "frontend/docs/publish-live.md": "Instructions and safety rules for publishing Version 29 to Live, enforcing strict version locking and frontend-only deployment.",
  "frontend/docs/releases/v29-live-publish-execution-log.md": "Execution log documenting the successful Version 29 Live frontend deployment, validations, and post-deploy checks.",
  "frontend/docs/releases/v29-live-smoke-test-report.md": "Completed Version 29 Live smoke test report template for operators to fill out during verification.",
  "frontend/docs/rollback-to-v35.md": "Procedure for frontend-only rollback to Version 35 in Draft mode to restore catalog visibility without touching backend state.",
  "frontend/index.css": "Tailwind-based global styles defining color variables, theming, and base layout for light and dark modes.",
  "frontend/index.html": "HTML entry point defining the root element and loading the frontend application via main.tsx.",
  "frontend/scripts/check-displayed-version-29.sh": "Scans frontend source files for hardcoded version labels and fails if any version other than 29 is found.",
  "frontend/scripts/check-displayed-version-35.sh": "Validates VERSION equals 35 and checks source files and Footer.tsx for correct Version 35 usage during rollback.",
  "frontend/scripts/deployment-preflight.sh": "Runs preflight checks for Version 29 frontend-only deployment, enforcing version locks and validating environment and build files.",
  "frontend/scripts/enforce-version-29.sh": "Enforces that VERSION is exactly 29 and blocks Live deployment otherwise.",
  "frontend/scripts/live-smoke-test-v22-helper.sh": "Prints a manual smoke‑test checklist and key URLs for verifying Version 22 Live deployment.",
  "frontend/scripts/live-smoke-test-v29-helper.sh": "Displays key URLs and manual smoke‑test steps for validating Version 29 on Live.",
  "frontend/scripts/publish-live.sh": "Publishes Version 29 frontend to Live, enforcing version checks and running displayed‑version validation before deployment.",
  "frontend/scripts/rebuild-draft-v29.sh": "Rebuilds the frontend in Draft mode enforcing Version 29, regenerates bindings, cleans artifacts, and builds without touching the backend.",
  "frontend/scripts/rollback-frontend-v35.sh": "Performs a frontend-only rollback to Version 35 in Draft mode, updating VERSION, rebuilding, verifying, and deploying the frontend canister.",
  "frontend/scripts/rollback-preflight.sh": "Runs preflight checks for Version 35 rollback, validating files, environment, dependencies, and safety constraints.",
  "frontend/src/App.tsx": "Configures the app router and theme provider, defining all main routes and rendering the layout and toaster.",
  "frontend/src/components/admin/BookMediaManager.tsx": "Admin tool for uploading and removing book media files with progress tracking, validation, and toast notifications.",
  "frontend/src/components/auth/AdminRoute.tsx": "Protects admin routes by checking identity and admin status, showing loading, error, or recovery options as needed.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with status handling, query reset, and toast feedback.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Displays a dialog prompting authenticated users without a profile to enter and save their name, handling validation and errors.",
  "frontend/src/components/books/BookCard.tsx": "Renders a book card with cover, title, pricing, availability badges, and navigation to book details.",
  "frontend/src/components/books/CoverImage.tsx": "Shows a book cover image using an uploaded file or fallback images with error handling.",
  "frontend/src/components/checkout/KycVerificationCard.tsx": "Collects and validates user ID or certificate numbers for KYC, submitting them and showing verification status.",
  "frontend/src/components/checkout/SelfieCapture.tsx": "Empty placeholder file for selfie capture functionality.",
  "frontend/src/components/EmptyState.tsx": "Reusable empty-state UI component displaying an icon, title, description, and optional action.",
  "frontend/src/components/layout/Footer.tsx": "Displays site footer with social links, copyright, version info, and support chat.",
  "frontend/src/components/layout/Header.tsx": "Top navigation bar showing branding, links, user balance, cart status, and auth-controlled sections.",
  "frontend/src/components/layout/Layout.tsx": "Main layout wrapper including header, footer, routed content, and profile setup dialog.",
  "frontend/src/components/layout/PageLayout.tsx": "Wrapper component providing consistent page padding and configurable max width.",
  "frontend/src/components/library/BookContentDialog.tsx": "Dialog showing purchased book content and downloadable media with loading and error states.",
  "frontend/src/components/library/LibraryPdfDownloadButton.tsx": "Provides a button that downloads a purchased book’s PDF using the actor API and shows loading and error toasts.",
  "frontend/src/components/support/CustomerServiceChatDialog.tsx": "Implements a dialog for submitting support messages and viewing message threads with admin responses.",
  "frontend/src/config/environment.ts": "Normalizes build-time environment variables into a Draft or Live environment value.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous actor and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useAdminRecovery.ts": "Offers a mutation to recover admin access with mapped error messages and invalidates admin status on success.",
  "frontend/src/hooks/useAuthz.ts": "Provides hooks for fetching and saving the caller’s user profile and checking admin status.",
  "frontend/src/hooks/useBalance.ts": "Fetches the user’s token balance and provides a mutation for minting tokens with cache invalidation.",
  "frontend/src/hooks/useBooks.ts": "Supplies queries and mutations for listing, retrieving, creating, updating, and uploading PDFs for books.",
  "frontend/src/hooks/useCart.ts": "Manages cart operations including fetching, adding, removing, checkout, and computing totals with book data.",
  "frontend/src/hooks/useCatalogTransfer.ts": "Exports or imports full catalog state and invalidates all related caches after import.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, including login, logout, and identity loading. Wraps AuthClient creation with custom options and exposes status flags.",
  "frontend/src/hooks/useKyc.ts": "Defines a mutation hook to submit KYC document identifiers through the actor API and invalidates cart data on success. Handles backend error strings and returns verified status.",
  "frontend/src/hooks/useLibrary.ts": "Provides hooks to derive a user's library from their delivered orders and to fetch purchased book content or media. Includes a utility to fetch a purchased book's PDF bytes.",
  "frontend/src/hooks/useOrders.ts": "Contains hooks for fetching a single order, a user's own orders using their identity, and all orders. Uses actor availability and identity checks for query enabling.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file exporting nothing; query hooks are defined elsewhere.",
  "frontend/src/hooks/useResetStore.ts": "Defines an admin-only mutation to reset store data and invalidates related query caches. Handles permission errors and generic failures.",
  "frontend/src/hooks/useSupportChat.ts": "Provides hooks for sending support messages, retrieving user/admin messages, fetching message responses, and replying as admin. Uses polling and actor-based queries.",
  "frontend/src/index.css": "Tailwind base stylesheet defining theme variables for light and dark modes with a bookstore color palette. Applies global background, text, and border styles.",
  "frontend/src/lib/utils.ts": "Exports a utility function combining clsx and tailwind-merge for merging class names.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider. Imports global styles.",
  "frontend/src/pages/admin/AdminCatalogPage.tsx": "Provides an interface for admins to view, filter, add, edit, and manage books in the catalog.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Serves as the main admin hub with tabbed navigation to catalog, orders, minting, support, and settings pages.",
  "frontend/src/pages/admin/AdminMintPage.tsx": "Allows admins to mint GLDT tokens by submitting a principal and token amount.",
  "frontend/src/pages/admin/AdminOrdersPage.tsx": "Displays all customer orders with item details, totals, and timestamps for admin review.",
  "frontend/src/pages/admin/AdminRecoveryPage.tsx": "Enables admins to recover access using Internet Identity, showing login prompts and recovery status.",
  "frontend/src/pages/admin/AdminSettingsPage.tsx": "Provides tools for resetting the store, exporting catalog data, and importing catalog files with various modes.",
  "frontend/src/pages/admin/AdminSupportInboxPage.tsx": "Admin UI for viewing support message threads and sending replies, grouping messages and handling refresh and responses.",
  "frontend/src/pages/BookDetailsPage.tsx": "Renders book details with purchase options, handles add-to-cart logic, loading states, and error toasts. Pulls book data and identity to conditionally allow purchases.",
  "frontend/src/pages/CartPage.tsx": "Displays the user's cart, handles item removal, detects invalid quantities, and navigates to checkout if valid.",
  "frontend/src/pages/CatalogPage.tsx": "Shows all books with search filtering, loading states, and error handling for failed fetches.",
  "frontend/src/pages/CheckoutPage.tsx": "Validates cart state, balance, and KYC requirements before submitting an order and navigating to confirmation.",
  "frontend/src/pages/HomePage.tsx": "Renders a hero section and a featured books grid pulled from available books.",
  "frontend/src/pages/MyLibraryPage.tsx": "Displays purchased books, allows reading or downloading content, and handles loading or empty states.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Shows purchase confirmation, order details, and navigation options after checkout.",
  "frontend/src/pages/PurchaseConfirmationPage.tsx": "Displays purchase confirmation with navigation options to the library, order details, or catalog.",
  "frontend/src/utils/catalogTransfer.ts": "Validates, parses, and merges catalog JSON data, supporting overwrite and merge import modes for CatalogState.",
  "frontend/src/utils/download.ts": "Utility functions to download raw data, URLs, or JSON files via generated Blob links.",
  "frontend/src/utils/format.ts": "Helpers for formatting token amounts, principals, and timestamps into user-friendly strings.",
  "frontend/src/utils/kyc.ts": "Provides KYC identifier creation and basic validation for document numbers.",
  "frontend/src/utils/kycRestrictionErrors.ts": "Detects KYC-related purchase restriction errors and maps them to friendly messages.",
  "frontend/src/utils/orderId.ts": "Generates a unique order ID based on timestamp and randomness.",
  "frontend/src/utils/principal.ts": "Parses and validates principal strings using the ICP SDK.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters and session-stored values.",
  "frontend/tailwind.config.js": "TailwindCSS configuration extending themes, colors, animations, and enabling plugins.",
  "frontend/VERSION": "Stores the enforced frontend version number, currently 29.",
  "project_state.json": "Project state metadata describing features, requirements, and rollback-related configuration."
}