{
  "backend/main.mo": "Main backend canister defining books, carts, orders, KYC state, access control, storage mixins, and owner recovery utilities.",
  "backend/migration.mo": "Migration module defining legacy state types and a pass-through run function for state upgrades.",
  "feature_evidence.json": "Feature evidence report mapping recent KYC‑related frontend changes to affected files and components.",
  "frontend-file-summaries.txt": "Prewritten summary list describing the purpose of all frontend files in the project.",
  "frontend/index.css": "Global Tailwind CSS configuration defining theme variables, dark mode tokens, and base styling.",
  "frontend/index.html": "Root HTML file loading the React app entrypoint.",
  "frontend/src/App.tsx": "Sets up the app’s routing, theme provider, toaster notifications, and root layout.",
  "frontend/src/components/admin/BookMediaManager.tsx": "Admin tool for uploading, previewing, and removing book media files with progress tracking and validation.",
  "frontend/src/components/auth/AdminRoute.tsx": "Protects admin-only routes by checking identity and admin status, showing loading or error states before rendering children.",
  "frontend/src/components/auth/LoginButton.tsx": "Displays a login/logout button using Internet Identity, handling login flow, logout, and error recovery.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Shows a dialog prompting authenticated users without a profile to enter a name and saves it via backend hooks.",
  "frontend/src/components/books/BookCard.tsx": "Renders a book preview card with cover, metadata, pricing, availability badges, and link to details.",
  "frontend/src/components/books/CoverImage.tsx": "Displays a static book cover image with fallback handling for load errors.",
  "frontend/src/components/checkout/KycVerificationCard.tsx": "Collects and validates user document info for KYC-restricted purchases, submitting verification and showing success or errors.",
  "frontend/src/components/checkout/SelfieCapture.tsx": "Placeholder file with no implemented content.",
  "frontend/src/components/EmptyState.tsx": "Reusable UI component for displaying empty-state messages with optional icon and actions.",
  "frontend/src/components/layout/Footer.tsx": "Renders the site footer with contact links, chat dialog, and attribution.",
  "frontend/src/components/layout/Header.tsx": "Displays the site header with navigation, user balance, cart status, and login/logout controls.",
  "frontend/src/components/layout/Layout.tsx": "Defines the overall page layout including header, footer, routed content, and profile setup dialog.",
  "frontend/src/components/layout/PageLayout.tsx": "Provides a container wrapper with configurable max-width for page sections.",
  "frontend/src/components/library/BookContentDialog.tsx": "Dialog that displays purchased book content and media with loading, errors, previews, and download actions.",
  "frontend/src/components/library/LibraryPdfDownloadButton.tsx": "Button that fetches and downloads a purchased book's PDF, handling auth, errors, and loading state.",
  "frontend/src/components/support/CustomerServiceChatDialog.tsx": "Customer support chat dialog allowing users to send messages and view threaded responses.",
  "frontend/src/hooks/useActor.ts": "React-query hook that creates and manages the authenticated or anonymous backend actor instance and invalidates dependent queries on change.",
  "frontend/src/hooks/useAdminRecovery.ts": "Mutation hook to trigger admin access recovery with detailed error mapping and cache invalidation.",
  "frontend/src/hooks/useAuthz.ts": "Hooks for fetching and saving the caller's user profile and checking admin status via the backend actor.",
  "frontend/src/hooks/useBalance.ts": "Hooks to fetch the user's token balance and mint new tokens, updating cache on success.",
  "frontend/src/hooks/useBooks.ts": "Collection of hooks for fetching, creating, updating, and uploading content for books via the backend actor.",
  "frontend/src/hooks/useCart.ts": "Hooks for managing the shopping cart, including fetching, adding, removing items, checkout, and computing totals.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity authentication using AuthClient, including login, logout, and status tracking.",
  "frontend/src/hooks/useKyc.ts": "Defines a mutation hook to submit document-based KYC proofs and handles backend validation responses.",
  "frontend/src/hooks/useLibrary.ts": "Fetches a user's purchased books and provides hooks for retrieving book content and media.",
  "frontend/src/hooks/useOrders.ts": "Provides hooks to fetch a single order, user-specific orders, or all orders using the actor API.",
  "frontend/src/hooks/useQueries.ts": "Empty file serving as a placeholder for organizing query hooks.",
  "frontend/src/hooks/useResetStore.ts": "Defines a mutation hook to reset the backend store and invalidate related query caches, with permission-aware error handling.",
  "frontend/src/hooks/useSupportChat.ts": "Implements hooks for sending support messages, fetching user/admin messages, and replying to messages with polling support.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom CSS variables for light and dark themes.",
  "frontend/src/lib/utils.ts": "Exports a utility function for merging Tailwind class names cleanly.",
  "frontend/src/main.tsx": "Initializes the React app with QueryClient and InternetIdentityProvider wrappers.",
  "frontend/src/pages/admin/AdminCatalogPage.tsx": "Provides an admin interface to view, add, edit, and manage books, including dialogs for content and media management.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Renders the admin dashboard with tabbed navigation for catalog, orders, minting, support, and settings pages.",
  "frontend/src/pages/admin/AdminMintPage.tsx": "Allows admins to mint GLDT tokens by entering a principal and amount, with form validation and mutation handling.",
  "frontend/src/pages/admin/AdminOrdersPage.tsx": "Displays all customer orders in a table with order details, totals, and item lookup.",
  "frontend/src/pages/admin/AdminRecoveryPage.tsx": "Handles admin recovery flow using Internet Identity, showing login prompts, recovery actions, and success/error states.",
  "frontend/src/pages/admin/AdminSettingsPage.tsx": "Provides store reset functionality with warnings, confirmation dialog, and status alerts for reset operations.",
  "frontend/src/pages/admin/AdminSupportInboxPage.tsx": "Admin page that lists customer support message threads and lets admins view and reply to messages.",
  "frontend/src/pages/BookDetailsPage.tsx": "Renders book detail UI with add-to-cart logic, loading skeletons, and error handling.",
  "frontend/src/pages/CartPage.tsx": "Handles viewing and managing the shopping cart, including quantity validation, item removal, and navigating to checkout.",
  "frontend/src/pages/CatalogPage.tsx": "Displays available books with search filtering and loading states using a grid of BookCard components.",
  "frontend/src/pages/CheckoutPage.tsx": "Manages the checkout flow with balance checks, KYC validation, order submission, and error handling.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage with a hero section and a featured books grid sourced from available books.",
  "frontend/src/pages/MyLibraryPage.tsx": "Shows the user's purchased books with media indicators and supports reading or downloading book content.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Displays order confirmation details, purchased items, and navigation options after a successful checkout.",
  "frontend/src/pages/PurchaseConfirmationPage.tsx": "Displays a purchase confirmation message with navigation buttons to library, order details, and catalog.",
  "frontend/src/utils/download.ts": "Provides helpers to download binary data or direct URLs as files via browser anchors.",
  "frontend/src/utils/format.ts": "Utility functions for formatting token amounts, principals, and timestamps into readable strings.",
  "frontend/src/utils/kyc.ts": "Generates stable KYC identifiers and validates document numbers for minimum formatting rules.",
  "frontend/src/utils/kycRestrictionErrors.ts": "Detects backend KYC restriction errors and maps them to a user-friendly message.",
  "frontend/src/utils/orderId.ts": "Creates a simple order ID using timestamp and a random number.",
  "frontend/src/utils/principal.ts": "Parses and validates principal strings using the ICP SDK.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters, with support for hash routing and session storage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme colors, fonts, animations, and plugin integrations.",
  "project_state.json": "Captures project metadata, feature statuses, and requirements for updating KYC purchase restriction rules."
}