{
  "backend/main.mo": "Defines the main backend actor with storage mixins, access control, book/catalog types, KYC structures, message handling state, and an admin‑restricted exportCatalog function.",
  "feature_evidence.json": "Provides feature evidence entries listing related files, components, and test IDs for publishing Version 29 and performing the Version 29 live smoke test.",
  "frontend-file-summaries.txt": "Contains prewritten short summaries for numerous frontend source files describing their roles in routing, UI components, pages, and media rendering.",
  "frontend/.env.production": "Sets VITE_APP_ENV=Live for production builds to ensure the Live environment badge.",
  "frontend/docs/deployment-preflight.md": "Explains preflight validation required before publishing Version 29, including version lock, environment checks, dependency verification, and production build validation.",
  "frontend/docs/draft-rebuild-v29.md": "Describes procedures and safety rules for rebuilding Draft Version 29 without affecting the Live site or backend canister.",
  "frontend/docs/live-smoke-test-v22.md": "Provides manual verification steps for Live Smoke Test Version 22, covering environment badge, catalog, media, and purchase flow checks.",
  "frontend/docs/live-smoke-test-v29-report-template.md": "Template for documenting results of the Version 29 Live smoke test, including checklist sections for environment, catalog, purchase flow, and library verification.",
  "frontend/docs/live-smoke-test-v29.md": "Manual smoke test checklist for verifying Version 29 on the Live site, covering environment badge, version label, catalog, book details, and other UI checks.",
  "frontend/docs/publish-live.md": "Instructions for publishing Version 29 to the Live frontend, enforcing version lock and detailing what the deployment does and does not modify.",
  "frontend/index.css": "Tailwind CSS setup defining light and dark theme CSS variables and base styles for the frontend.",
  "frontend/index.html": "Basic HTML entry point that loads the React app via main.tsx.",
  "frontend/scripts/deployment-preflight.sh": "Preflight script validating environment, version lock, dependencies, and build readiness for a frontend-only Version 29 Live deployment.",
  "frontend/scripts/enforce-version-29.sh": "Guard script ensuring the VERSION file contains exactly 29, blocking any non‑29 deployment.",
  "frontend/scripts/live-smoke-test-v22-helper.sh": "Helper script printing key URLs and the manual smoke test checklist for Version 22.",
  "frontend/scripts/live-smoke-test-v29-helper.sh": "Helper script printing key URLs and the manual smoke test checklist for Version 29.",
  "frontend/scripts/publish-live.sh": "Deploys only the Version 29 frontend to the live environment after enforcing version checks and running preflight validations.",
  "frontend/scripts/rebuild-draft-v29.sh": "Rebuilds the frontend in Draft mode for Version 29, regenerating bindings and producing a fresh local Draft build without publishing.",
  "frontend/src/App.tsx": "Defines the app's route structure using TanStack Router and wraps the UI with theme and toast providers.",
  "frontend/src/components/admin/BookMediaManager.tsx": "Provides upload and removal handling for a book’s PDF, images, audio, and video files with progress tracking and validation.",
  "frontend/src/components/auth/AdminRoute.tsx": "Protects admin-only pages by checking authentication and admin status, showing appropriate loading or error states.",
  "frontend/src/components/auth/LoginButton.tsx": "Button that manages Internet Identity login/logout flow with status handling and error recovery.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Prompts newly authenticated users to enter a name and saves their profile if none exists.",
  "frontend/src/components/books/BookCard.tsx": "Displays a book card with cover, title, pricing badges, availability states, and link to details.",
  "frontend/src/components/books/CoverImage.tsx": "Renders a book cover using an uploaded image or fallback placeholders with error handling.",
  "frontend/src/components/checkout/KycVerificationCard.tsx": "Handles KYC document submission, validation, and verification state during checkout.",
  "frontend/src/components/checkout/SelfieCapture.tsx": "Placeholder component with no implemented content.",
  "frontend/src/components/EmptyState.tsx": "Reusable component for showing a centered empty-state message with optional icon, description, and action.",
  "frontend/src/components/layout/Footer.tsx": "Shows contact links, attribution, version info, and a customer service chat entry.",
  "frontend/src/components/layout/Header.tsx": "Renders the main navigation bar with auth state, cart count, balance, and environment badge.",
  "frontend/src/components/layout/Layout.tsx": "Defines the overall page layout with header, footer, and routed content outlet.",
  "frontend/src/components/layout/PageLayout.tsx": "Wraps page content with configurable max‑width and padding.",
  "frontend/src/components/library/BookContentDialog.tsx": "Dialog for viewing and downloading purchased book content and media with loading and error states.",
  "frontend/src/components/library/LibraryPdfDownloadButton.tsx": "Provides a button to download a purchased book’s PDF with permission checks and error messaging.",
  "frontend/src/components/support/CustomerServiceChatDialog.tsx": "Customer support chat dialog allowing users to submit messages and view threaded responses using support chat hooks.",
  "frontend/src/config/environment.ts": "Normalizes Vite env variables to Draft or Live and exports the resolved environment.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on user identity and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useAdminRecovery.ts": "Provides a mutation to trigger admin access recovery with mapped error messages and cache invalidation.",
  "frontend/src/hooks/useAuthz.ts": "Hooks for fetching and updating user profiles and checking admin status using the backend actor.",
  "frontend/src/hooks/useBalance.ts": "Hooks for retrieving user token balance and minting tokens with automatic cache updates.",
  "frontend/src/hooks/useBooks.ts": "Hooks for fetching, adding, updating, and uploading content for books, with cache invalidations on changes.",
  "frontend/src/hooks/useCart.ts": "Hooks for managing cart items, checkout flow, and computing cart totals with linked book data.",
  "frontend/src/hooks/useCatalogTransfer.ts": "Exports and imports full catalog state and invalidates related caches after import.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, handles login state, and exposes identity, login, and logout operations.",
  "frontend/src/hooks/useKyc.ts": "Provides a mutation hook to submit document-based KYC and invalidate the cart on success.",
  "frontend/src/hooks/useLibrary.ts": "Builds the user's library from their orders and books and provides hooks to fetch purchased content or media.",
  "frontend/src/hooks/useOrders.ts": "Exposes hooks for fetching a single order, the user's orders, or all orders through the actor API.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file exporting nothing.",
  "frontend/src/hooks/useResetStore.ts": "Defines a mutation to reset the backend store and invalidates all related queries, with permission-aware error handling.",
  "frontend/src/hooks/useSupportChat.ts": "Implements hooks for sending support messages, fetching user or admin messages, and replying as an admin.",
  "frontend/src/index.css": "Tailwind CSS setup defining theme variables for light and dark modes with a bookstore color palette.",
  "frontend/src/lib/utils.ts": "Exports a utility function for merging class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider and mounts it to the DOM.",
  "frontend/src/pages/admin/AdminCatalogPage.tsx": "Provides admin interfaces to view, add, edit, delete, and manage book metadata and media.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Hosts the admin dashboard with tabs for catalog, orders, minting, support, and settings.",
  "frontend/src/pages/admin/AdminMintPage.tsx": "Provides a form for admins to mint GLDT tokens by entering a recipient principal and amount, handling validation and success/error feedback.",
  "frontend/src/pages/admin/AdminOrdersPage.tsx": "Displays all customer orders in a table with order details, item titles, totals, and timestamps using fetched order and book data.",
  "frontend/src/pages/admin/AdminRecoveryPage.tsx": "Allows admins to recover access by signing in with Internet Identity and running a recovery mutation, showing success or error states.",
  "frontend/src/pages/admin/AdminSettingsPage.tsx": "Offers admin tools for resetting the store, exporting the catalog, importing catalog files with merge/overwrite modes, and handling file parsing and confirmation.",
  "frontend/src/pages/admin/AdminSupportInboxPage.tsx": "Shows threaded customer support messages, lets admins view conversations, and send replies through a response mutation.",
  "frontend/src/pages/BookDetailsPage.tsx": "Displays detailed information for a book, handles add-to-cart actions, and manages sold-out and loading states.",
  "frontend/src/pages/CartPage.tsx": "Shows the user's cart with item management, single-copy validation, and checkout handling.",
  "frontend/src/pages/CatalogPage.tsx": "Renders the book catalog with search filtering and loading states.",
  "frontend/src/pages/CheckoutPage.tsx": "Implements the checkout flow with balance checks, KYC verification, cart validation, and order submission.",
  "frontend/src/pages/HomePage.tsx": "Displays the homepage with a hero section and a featured books list pulled from available books.",
  "frontend/src/pages/MyLibraryPage.tsx": "Shows the user’s purchased books and allows reading or downloading associated media.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Loads and displays details of a completed order, including items and total paid.",
  "frontend/src/pages/PurchaseConfirmationPage.tsx": "Shows a purchase success message with actions to view the library, order details, or continue shopping.",
  "frontend/src/utils/catalogTransfer.ts": "Validates, parses, and merges catalog JSON data, supporting overwrite and merge modes for catalog import operations.",
  "frontend/src/utils/download.ts": "Provides helpers to download raw data, URLs, or JSON files by generating blobs and triggering browser downloads.",
  "frontend/src/utils/format.ts": "Contains formatting utilities for token amounts, principals, and timestamps, plus parsing for token amounts.",
  "frontend/src/utils/kyc.ts": "Generates stable KYC identifiers and validates document numbers with basic checks.",
  "frontend/src/utils/kycRestrictionErrors.ts": "Provides functions to detect KYC-related purchase restriction errors and map them to a user-friendly message.",
  "frontend/src/utils/orderId.ts": "Generates a unique order ID using a timestamp and random number.",
  "frontend/src/utils/principal.ts": "Parses a principal string into a Principal object and throws an error for invalid formats.",
  "frontend/src/utils/urlParams.ts": "Handles reading, storing, and clearing URL and session parameters, supporting both query and hash-based routing.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS theme, colors, fonts, animations, and plugins for the frontend.",
  "frontend/VERSION": "Specifies the frontend version as 29.",
  "project_state.json": "Stores project metadata, version state, notes, and existing feature records for build management."
}