{
  "backend/main.mo": "Main backend canister defining user profiles, books, carts, orders, KYC structures, support messages, and an exportCatalog admin function with storage and authorization mixins.",
  "backend/migration.mo": "Migration module that preserves nextMessageId for backward compatibility.",
  "feature_evidence.json": "Feature evidence report mapping features to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "List of short human-written summaries for various frontend components and pages.",
  "frontend/.env.production": "Production environment variables setting Live environment and version 29.",
  "frontend/docs/deployment-preflight.md": "Preflight deployment checklist detailing version enforcement and validation steps for Live and rollback workflows.",
  "frontend/docs/draft-rebuild-v29.md": "Instructions for rebuilding Draft Version 29 safely without deploying to Live.",
  "frontend/docs/draft-regression-checks.md": "Manual regression checklist for verifying catalog visibility and core frontend behavior before Live promotion.",
  "frontend/docs/live-smoke-test-v22.md": "Smoke test procedure for validating Live deployment of Draft Version 22 including environment badge, catalog, media, and purchase flow checks.",
  "frontend/docs/live-smoke-test-v29-report-template.md": "Template for operators to fill out results of the Version 29 Live smoke test, including environment checks, catalog validation, and purchase flow steps.",
  "frontend/docs/live-smoke-test-v29.md": "Detailed checklist describing how to manually verify all core frontend features after deploying Version 29 to Live.",
  "frontend/docs/publish-live.md": "Instructions and safety rules for publishing Version 29 to the Live environment, enforcing version locks and frontend-only deployment.",
  "frontend/docs/releases/v29-live-publish-execution-log.md": "Execution log documenting the Live deployment of Version 29, including validation, build steps, and confirmation that only the frontend was deployed.",
  "frontend/docs/releases/v29-live-smoke-test-report.md": "Completed Version 29 Live smoke test report template for operators to record test results and observations.",
  "frontend/docs/rollback-to-v35.md": "Procedure for rolling back the frontend to Version 35 in Draft mode without modifying backend state.",
  "frontend/index.css": "Tailwind CSS setup defining color variables and theming for light and dark modes.",
  "frontend/index.html": "Basic HTML entrypoint loading the root element and main TypeScript application.",
  "frontend/scripts/check-displayed-version-29.sh": "Scans frontend source files for hardcoded version labels and fails if any displayed version is not 29.",
  "frontend/scripts/check-displayed-version-35.sh": "Validates rollback readiness for Version 35 by checking VERSION=35, scanning for non‑35 labels, and ensuring Footer uses VITE_APP_VERSION.",
  "frontend/scripts/deployment-preflight.sh": "Runs pre-deployment checks for Version 29, enforcing version lock, scanning for version labels, and validating environment config.",
  "frontend/scripts/enforce-version-29.sh": "Blocks deployment unless VERSION file exists and is exactly 29, acting as a guardrail for Live publishes.",
  "frontend/scripts/live-smoke-test-v22-helper.sh": "Prints manual smoke‑test checklist and key URLs for verifying Version 22 Live deployment.",
  "frontend/scripts/live-smoke-test-v29-helper.sh": "Outputs manual smoke‑test steps and key URLs for validating Live deployment of Version 29.",
  "frontend/scripts/publish-live.sh": "Publishes Version 29 frontend to Live, enforcing version checks and running preflight and displayed‑version validations before deployment.",
  "frontend/scripts/rebuild-draft-v29.sh": "Rebuilds the frontend in Draft mode strictly for Version 29, enforcing version checks, regenerating bindings, cleaning artifacts, and running a Draft-configured build without touching the backend.",
  "frontend/scripts/rollback-frontend-v35.sh": "Performs a frontend-only rollback to Version 35 in Draft mode by updating the VERSION file, rebuilding, running preflight checks, and deploying only the frontend canister.",
  "frontend/scripts/rollback-preflight.sh": "Runs safety and validation checks for the Version 35 rollback, verifying files, dependencies, version correctness, and dfx availability.",
  "frontend/src/App.tsx": "Defines the app’s router structure and routes for all major pages, wrapping the interface with theme support and global toasts.",
  "frontend/src/components/admin/BookMediaManager.tsx": "Admin component for uploading and removing book media (PDF, images, audio, video) with progress tracking and validation.",
  "frontend/src/components/admin/ReEnableBooksByIdentifierCard.tsx": "Admin tool allowing re-enabling of books by text identifier, showing detailed success or warning results after mutation.",
  "frontend/src/components/auth/AdminRoute.tsx": "Guards admin-only routes by checking identity and admin status, showing loading or error states before rendering children.",
  "frontend/src/components/auth/LoginButton.tsx": "Provides a login/logout button using Internet Identity with error handling and status display.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Shows a dialog prompting authenticated users without a profile to enter their name and saves it.",
  "frontend/src/components/books/BookCard.tsx": "Displays a book preview card with cover, metadata, availability badges, price, and link to details.",
  "frontend/src/components/books/CoverImage.tsx": "Renders a book cover using uploaded image or fallback placeholders, with error recovery.",
  "frontend/src/components/checkout/KycVerificationCard.tsx": "Collects and validates KYC document info, submits verification, and displays success or error states.",
  "frontend/src/components/checkout/SelfieCapture.tsx": "Placeholder file with no implemented content.",
  "frontend/src/components/EmptyState.tsx": "A reusable empty‑state component displaying an optional icon, title, description, and action button.",
  "frontend/src/components/layout/Footer.tsx": "Renders site footer with contact links, attribution, version display, and chat dialog.",
  "frontend/src/components/layout/Header.tsx": "Displays top navigation with logo, links, login, environment badge, balance, and cart indicator.",
  "frontend/src/components/layout/Layout.tsx": "Defines overall page structure including header, footer, content outlet, and profile setup dialog.",
  "frontend/src/components/layout/PageLayout.tsx": "Generic page wrapper providing configurable max-width and spacing for page content.",
  "frontend/src/components/library/BookContentDialog.tsx": "Displays purchased book content and media, handling loading, errors, downloads, and expandable images.",
  "frontend/src/components/library/LibraryPdfDownloadButton.tsx": "Provides a button to download a purchased book's PDF with error handling and filename formatting.",
  "frontend/src/components/support/CustomerServiceChatDialog.tsx": "Implements a dialog for submitting support messages and viewing threaded responses with authentication-aware behavior.",
  "frontend/src/config/environment.ts": "Determines the app's environment (Draft or Live) based on Vite variables and exports the resolved value.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on user identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useAdminRecovery.ts": "Provides a mutation for admin access recovery with user-friendly error mapping and cache invalidation.",
  "frontend/src/hooks/useAuthz.ts": "Defines hooks for fetching and saving user profiles and checking admin status using the backend actor.",
  "frontend/src/hooks/useBalance.ts": "Includes hooks to fetch token balance and mint new tokens, updating cached balance on success.",
  "frontend/src/hooks/useBooks.ts": "Offers queries and mutations for managing books, including listing, fetching, adding, updating, and uploading content.",
  "frontend/src/hooks/useCart.ts": "React-query hooks for fetching, modifying, and checking out the shopping cart, including enriched cart data with book details.",
  "frontend/src/hooks/useCatalogTransfer.ts": "Provides export and import mutations for the catalog and invalidates related caches after import.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity context and provider handling login, identity persistence, and auth-client setup.",
  "frontend/src/hooks/useKyc.ts": "Mutation hook submitting document-based KYC proofs and updating cart-related queries on success.",
  "frontend/src/hooks/useLibrary.ts": "Builds a user library from delivered orders and provides hooks to fetch purchased book content and media.",
  "frontend/src/hooks/useOrders.ts": "React-query hooks for fetching individual orders, user orders, and all orders based on actor and identity state.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file for organizational purposes.",
  "frontend/src/hooks/useResetStore.ts": "Admin-only store reset mutation that clears multiple caches and handles permission-related errors.",
  "frontend/src/hooks/useSupportChat.ts": "Hooks for sending support messages, fetching user/admin message threads, and replying to messages with polling.",
  "frontend/src/index.css": "TailwindCSS setup defining light/dark theme variables and base styling for the app.",
  "frontend/src/lib/utils.ts": "Utility function combining clsx and tailwind-merge for class name merging.",
  "frontend/src/main.tsx": "Application entry point initializing React, react-query, Internet Identity, and global styles.",
  "frontend/src/pages/admin/AdminCatalogPage.tsx": "Admin interface for viewing, filtering, adding, editing, and managing catalog books and their media/content. Fetches all books and provides multiple management dialogs.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin dashboard with tabs for catalog, orders, token minting, support inbox, and settings. Wraps all admin pages with admin access control.",
  "frontend/src/pages/admin/AdminMintPage.tsx": "Admin form for minting GLDT tokens to a specified principal. Validates input and triggers the mint mutation with success or error feedback.",
  "frontend/src/pages/admin/AdminOrdersPage.tsx": "Displays a table of all orders with customer, items, totals, and dates, fetching each book title for ordered items. Handles loading and empty states.",
  "frontend/src/pages/admin/AdminRecoveryPage.tsx": "Provides admin access recovery flow requiring Internet Identity sign-in, with success state and navigation to the admin panel.",
  "frontend/src/pages/admin/AdminSettingsPage.tsx": "Admin settings UI for resetting, exporting, and importing the catalog with file parsing and merge/overwrite options.",
  "frontend/src/pages/admin/AdminSupportInboxPage.tsx": "Admin inbox for viewing grouped customer support messages and sending responses.",
  "frontend/src/pages/BookDetailsPage.tsx": "Displays detailed info for a single book, handles add‑to‑cart logic, identity checks, and sold‑out conditions.",
  "frontend/src/pages/CartPage.tsx": "Shows cart items with book details, validates single‑copy constraints, and manages item removal and checkout navigation.",
  "frontend/src/pages/CatalogPage.tsx": "Lists all available books with search filtering and error/loading states.",
  "frontend/src/pages/CheckoutPage.tsx": "Processes checkout with balance checks, KYC flow, single‑copy validation, and order submission.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage hero section and shows featured books from the catalog.",
  "frontend/src/pages/MyLibraryPage.tsx": "Displays the user's purchased books and supports reading or downloading book content.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Displays order confirmation details, including purchased items, total amount, and navigation options. Fetches order and book data and handles loading or missing orders.",
  "frontend/src/pages/PurchaseConfirmationPage.tsx": "Shows a purchase completion message with actions to view the order, go to the library, or continue shopping.",
  "frontend/src/utils/catalogTransfer.ts": "Utilities for validating, parsing, and merging catalog JSON data for import/export operations.",
  "frontend/src/utils/download.ts": "Helper functions to download files or JSON content via browser-generated links.",
  "frontend/src/utils/format.ts": "Formatting helpers for token amounts, principals, and timestamps.",
  "frontend/src/utils/kyc.ts": "Utilities for deriving KYC identifiers and validating document numbers.",
  "frontend/src/utils/kycRestrictionErrors.ts": "Maps backend KYC restriction errors to user‑friendly messages.",
  "frontend/src/utils/orderId.ts": "Generates unique order IDs using timestamps and randomness.",
  "frontend/src/utils/principal.ts": "Parses a principal string into a Principal object with validation.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, and clearing URL or session‑persisted parameters.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, custom colors, typography, container queries, animations, and extended theme settings.",
  "frontend/VERSION": "Defines the frontend version as 29.",
  "project_state.json": "Defines the project’s current state, issues, and feature requests related to public catalog visibility and book availability management."
}