{
  "backend/main.mo": "Main backend actor defining user profiles, store data structures, admin recovery logic, support chat, and access‑controlled operations.",
  "backend/migration.mo": "Migration module passing through previous state while defining types aligned with backend storage.",
  "feature_evidence.json": "Feature evidence report mapping features to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries of multiple frontend components and pages.",
  "frontend/index.css": "Tailwind CSS configuration defining theme variables and base styling for light and dark modes.",
  "frontend/index.html": "HTML entry point that loads the root div and initializes the React application.",
  "frontend/src/App.tsx": "Main React app configuring routing, theme provider, and global toaster notifications.",
  "frontend/src/components/auth/AdminRoute.tsx": "Route guard enforcing admin access and offering a navigation link to the admin recovery page.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button managing Internet Identity actions with toast feedback.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Dialog prompting new authenticated users to set up their profile name.",
  "frontend/src/components/books/BookCard.tsx": "Displays a book card with cover, title, author, price, availability badge, and links to the book page.",
  "frontend/src/components/books/CoverImage.tsx": "Renders a book cover image with a fallback SVG placeholder on load error.",
  "frontend/src/components/EmptyState.tsx": "Reusable component for displaying empty-state UI with icon, text, and optional actions.",
  "frontend/src/components/layout/Footer.tsx": "Shows footer with social links, customer service chat, and attribution.",
  "frontend/src/components/layout/Header.tsx": "Header with navigation, balance display, cart button, and login support based on authentication.",
  "frontend/src/components/layout/Layout.tsx": "Page wrapper including header, footer, routed content, and profile setup dialog.",
  "frontend/src/components/layout/PageLayout.tsx": "Reusable page container applying max-width and padding classes.",
  "frontend/src/components/library/BookContentDialog.tsx": "Dialog displaying purchased book content with loading, error, and empty states.",
  "frontend/src/components/support/CustomerServiceChatDialog.tsx": "Modal chat interface for submitting support messages and viewing threaded conversations.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity and refreshes dependent queries on changes.",
  "frontend/src/hooks/useAdminRecovery.ts": "Mutation hook for triggering admin-access recovery with custom error handling and cache invalidation.",
  "frontend/src/hooks/useAuthz.ts": "Hooks for fetching and saving user profiles and checking admin status via the backend actor.",
  "frontend/src/hooks/useBalance.ts": "Hooks to fetch token balance and mint tokens, with cache invalidation on updates.",
  "frontend/src/hooks/useBooks.ts": "Provides React Query hooks for fetching, adding, updating, and deleting books via an actor API, with cache invalidation.",
  "frontend/src/hooks/useCart.ts": "Implements cart-related queries and mutations including fetching cart items, modifying cart contents, checkout, and deriving cart totals.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, login, logout, and AuthClient setup through a React context provider.",
  "frontend/src/hooks/useLibrary.ts": "Builds a user's owned book library from orders and books, and fetches purchased book content.",
  "frontend/src/hooks/useOrders.ts": "Provides hooks for fetching single orders, user orders, and all orders through the actor API.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file for central query organization.",
  "frontend/src/hooks/useResetStore.ts": "Mutation hook to reset backend store and invalidate all related React Query caches with error handling.",
  "frontend/src/hooks/useSupportChat.ts": "Implements user and admin support chat queries and mutations including sending messages, fetching messages, and replying.",
  "frontend/src/index.css": "Tailwind CSS setup defining theme colors, dark mode variables, and base styling.",
  "frontend/src/lib/utils.ts": "Exports a classnames helper merging clsx with tailwind-merge.",
  "frontend/src/main.tsx": "Initializes React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/admin/AdminCatalogPage.tsx": "Renders the admin catalog with book listing, add/edit dialogs, and actions for updating or deleting books.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Provides the main admin dashboard layout with tab navigation to catalog, orders, minting, support, and settings pages.",
  "frontend/src/pages/admin/AdminMintPage.tsx": "Allows admins to mint GLDT tokens by submitting a principal ID and token amount.",
  "frontend/src/pages/admin/AdminOrdersPage.tsx": "Displays all customer orders with item details, totals, and timestamps.",
  "frontend/src/pages/admin/AdminRecoveryPage.tsx": "Handles admin access recovery using Internet Identity and a recovery mutation.",
  "frontend/src/pages/admin/AdminSettingsPage.tsx": "Provides store reset functionality with warnings and success/error handling.",
  "frontend/src/pages/admin/AdminSupportInboxPage.tsx": "Shows customer support message threads and allows admins to reply to messages.",
  "frontend/src/pages/BookDetailsPage.tsx": "Page for displaying book details, handling add‑to‑cart, and showing loading or not‑found states.",
  "frontend/src/pages/CartPage.tsx": "Displays the user's cart, allows item removal, and navigates to checkout, with states for unauthenticated and empty carts.",
  "frontend/src/pages/CatalogPage.tsx": "Shows a searchable list of available books with loading states and filtered results.",
  "frontend/src/pages/CheckoutPage.tsx": "Handles checkout flow including balance checks, order creation, and navigation to confirmation, with login and empty-cart guards.",
  "frontend/src/pages/HomePage.tsx": "Provides a hero section and displays featured books pulled from the available catalog.",
  "frontend/src/pages/MyLibraryPage.tsx": "Displays the user's purchased books and allows reading by fetching book content, with login and loading states.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Shows order details after purchase, including items, total, and navigation to library or catalog.",
  "frontend/src/utils/format.ts": "Utility functions for formatting token amounts, principals, and timestamps.",
  "frontend/src/utils/orderId.ts": "Generates unique order IDs using timestamp and random values.",
  "frontend/src/utils/principal.ts": "Parses a principal string into a Principal object and throws an error if invalid.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL and hash params, persist them in sessionStorage, and clear stored or hash-based parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, fonts, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Tracks project metadata, issues, features, and architectural notes for an e‑book storefront with crypto payments."
}