{
  "backend/main.mo": "Main Motoko canister implementing book store logic, including storage, access control, user profiles, orders, carts, support messages, and admin recovery.",
  "feature_evidence.json": "Feature evidence report mapping new purchase confirmation and routing updates to affected frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries of numerous frontend files describing their purpose and behavior within the app.",
  "frontend/index.css": "Tailwind base stylesheet defining theme variables for light and dark modes and global styling rules.",
  "frontend/index.html": "Basic HTML entrypoint with root container and script loading the React application.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes, theme provider, toaster, and adds the new purchase confirmation route.",
  "frontend/src/components/auth/AdminRoute.tsx": "Route guard enforcing admin access and offering login prompts or an admin recovery link when unauthorized.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with loading states, error handling, and toast feedback.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Dialog prompting first-time authenticated users to enter and save their profile name.",
  "frontend/src/components/books/BookCard.tsx": "Displays a book’s cover, metadata, price, availability, and links to its detail page.",
  "frontend/src/components/books/CoverImage.tsx": "Displays a static book cover image with fallback SVG on load error.",
  "frontend/src/components/EmptyState.tsx": "Generic empty state UI component displaying an icon, title, description, and optional action.",
  "frontend/src/components/layout/Footer.tsx": "Renders the site footer with contact links, chat dialog trigger, and attribution.",
  "frontend/src/components/layout/Header.tsx": "Shows navigation, user balance, cart button, and login controls based on authentication.",
  "frontend/src/components/layout/Layout.tsx": "Wraps pages with header, footer, and a profile setup dialog.",
  "frontend/src/components/layout/PageLayout.tsx": "Provides a configurable max‑width container for page content.",
  "frontend/src/components/library/BookContentDialog.tsx": "Dialog for viewing purchased book content and downloading PDFs with loading and error states.",
  "frontend/src/components/library/LibraryPdfDownloadButton.tsx": "Button to download a purchased book’s PDF, handling errors and status.",
  "frontend/src/components/support/CustomerServiceChatDialog.tsx": "Customer support chat dialog allowing message submission and viewing threaded responses.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useAdminRecovery.ts": "Mutation hook to call admin recovery and map backend errors to user-friendly messages.",
  "frontend/src/hooks/useAuthz.ts": "Hooks for fetching and saving user profiles and checking admin status via the actor.",
  "frontend/src/hooks/useBalance.ts": "Hooks to get token balance and mint tokens, invalidating balance after updates.",
  "frontend/src/hooks/useBooks.ts": "React-query hooks for fetching and mutating book data, including book lists, individual books, metadata, content, and PDF uploads.",
  "frontend/src/hooks/useCart.ts": "Provides cart queries and mutations plus helpers to merge cart items with book data and compute totals.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity context and provider for authentication, storing identity state and exposing login utilities.",
  "frontend/src/hooks/useLibrary.ts": "Builds the user's library from delivered orders and exposes book content fetching helpers.",
  "frontend/src/hooks/useOrders.ts": "React-query hooks to fetch individual orders, user orders, and all orders via the actor.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file exporting nothing.",
  "frontend/src/hooks/useResetStore.ts": "Mutation hook to reset the backend store and invalidate all related caches with permission checks.",
  "frontend/src/hooks/useSupportChat.ts": "Contains support messaging hooks for sending messages, fetching user/admin inboxes, and posting admin replies.",
  "frontend/src/index.css": "Tailwind base/styles with custom color variables for light and dark bookstore themes.",
  "frontend/src/lib/utils.ts": "Utility for merging Tailwind class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Application entry point setting up React Query and Internet Identity provider before rendering App.",
  "frontend/src/pages/admin/AdminCatalogPage.tsx": "Provides an admin interface to list, add, edit, update content, upload PDFs, and delete books in the catalog.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Wraps all admin subpages in a tabbed dashboard inside an admin-protected route.",
  "frontend/src/pages/admin/AdminMintPage.tsx": "Allows admins to mint GLDT tokens by submitting a principal and amount, with validation and feedback.",
  "frontend/src/pages/admin/AdminOrdersPage.tsx": "Lists all orders for administrators, showing customer info, items, totals, and dates.",
  "frontend/src/pages/admin/AdminRecoveryPage.tsx": "Enables admin access recovery using Internet Identity, showing login prompts, recovery actions, and success feedback.",
  "frontend/src/pages/admin/AdminSettingsPage.tsx": "Admin page providing a UI to reset store data with confirmation dialogs and success/error alerts.",
  "frontend/src/pages/admin/AdminSupportInboxPage.tsx": "Admin inbox page that displays grouped customer support messages and allows sending replies.",
  "frontend/src/pages/BookDetailsPage.tsx": "Displays detailed info for a single book, handles add‑to‑cart actions, and shows loading or not‑found states.",
  "frontend/src/pages/CartPage.tsx": "Shows the user’s cart with items, supports removal and checkout navigation, and handles empty or unauthenticated states.",
  "frontend/src/pages/CatalogPage.tsx": "Lists all available books with a search filter and loading/empty states.",
  "frontend/src/pages/CheckoutPage.tsx": "Handles the checkout flow including balance checks, order submission, and various login/cart validation states.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage with a hero section and a featured books list.",
  "frontend/src/pages/MyLibraryPage.tsx": "Displays the user’s purchased books, supports reading and PDF download, and handles login/loading/empty states.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Displays order confirmation details, including purchased items and navigation buttons, after fetching order and book data.",
  "frontend/src/pages/PurchaseConfirmationPage.tsx": "Shows a simple purchase completion screen with next-step navigation options using the orderId param.",
  "frontend/src/utils/download.ts": "Utility to download a Uint8Array as a file by creating a temporary Blob URL.",
  "frontend/src/utils/format.ts": "Formatting helpers for token amounts, principals, and timestamps.",
  "frontend/src/utils/orderId.ts": "Generates a unique order ID using the current timestamp and a random number.",
  "frontend/src/utils/principal.ts": "Parses a principal string into a Principal object with validation.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, animations, and enabling plugins.",
  "project_state.json": "Metadata describing project features, state, and pending requests for a post‑purchase confirmation screen."
}