{
  "backend/main.mo": "Motoko canister implementing an e‑book store with user profiles, catalog, carts, orders, KYC records, and admin-only catalog export using storage and authorization mixins.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to related files, components, and test IDs with confidence levels.",
  "frontend-file-summaries.txt": "JSON-style text listing frontend file paths with short summaries of each component, page, or utility.",
  "frontend/.env.production": "Production environment file setting VITE_APP_ENV to Live.",
  "frontend/docs/deployment-preflight.md": "Documentation describing required preflight checks before deploying to the Live environment.",
  "frontend/docs/publish-live.md": "Instructions for publishing Draft Version 25 to the Live environment without wiping backend state.",
  "frontend/index.css": "Tailwind CSS setup defining base styles and color variables for light and dark themes.",
  "frontend/index.html": "HTML entry file mounting the frontend app and loading main.tsx.",
  "frontend/scripts/deployment-preflight.sh": "Shell script performing environment validation, dependency checks, backend/frontend builds, and bindings generation.",
  "frontend/scripts/publish-live.sh": "Shell script running preflight checks and deploying Draft Version 25 to the Live canister without resetting backend state.",
  "frontend/src/App.tsx": "Configures the app’s router with all main and admin routes and wraps the UI in theme and router providers.",
  "frontend/src/components/admin/BookMediaManager.tsx": "Manages uploading and removing PDF, image, audio, and video files for a book with progress and validation.",
  "frontend/src/components/auth/AdminRoute.tsx": "Guards admin-only pages by checking identity and admin status and shows appropriate access or error states.",
  "frontend/src/components/auth/LoginButton.tsx": "Provides login/logout functionality using Internet Identity with status handling and feedback.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Prompts authenticated users without a profile to enter their name and saves it via backend hooks.",
  "frontend/src/components/books/BookCard.tsx": "Renders a clickable book card showing cover, title, author, pricing, and availability badges.",
  "frontend/src/components/books/CoverImage.tsx": "Displays a book cover image using a fixed generated asset with a fallback placeholder on error.",
  "frontend/src/components/checkout/KycVerificationCard.tsx": "Handles client-side KYC document submission, validation, and displays verification completion status.",
  "frontend/src/components/checkout/SelfieCapture.tsx": "Empty placeholder file for selfie capture functionality.",
  "frontend/src/components/EmptyState.tsx": "Displays a centered empty-state message with optional icon, description, and action.",
  "frontend/src/components/layout/Footer.tsx": "Renders the site footer with contact links, customer support chat, and attribution.",
  "frontend/src/components/layout/Header.tsx": "Top navigation bar showing logo, links, environment badge, user balance, cart, and auth-aware sections.",
  "frontend/src/components/layout/Layout.tsx": "Page wrapper rendering header, footer, main content outlet, and profile setup dialog.",
  "frontend/src/components/layout/PageLayout.tsx": "Generic page container applying configurable max-width and padding layout classes.",
  "frontend/src/components/library/BookContentDialog.tsx": "Dialog displaying purchased book content and media with loading, error states, previews, and download handlers.",
  "frontend/src/components/library/LibraryPdfDownloadButton.tsx": "Button to fetch and download a purchased book’s PDF with permission handling and status feedback.",
  "frontend/src/components/support/CustomerServiceChatDialog.tsx": "Customer support chat dialog allowing users to send messages and view threaded responses.",
  "frontend/src/config/environment.ts": "Determines app environment (Draft or Live) from build-time variables and exports APP_ENVIRONMENT.",
  "frontend/src/hooks/useActor.ts": "React-query hook creating and caching the backend actor, updating on identity changes, and invalidating dependent queries.",
  "frontend/src/hooks/useAdminRecovery.ts": "Mutation hook to trigger admin access recovery with descriptive error mapping and cache invalidation.",
  "frontend/src/hooks/useAuthz.ts": "Hooks for fetching and saving user profiles and checking admin status based on the authenticated actor.",
  "frontend/src/hooks/useBalance.ts": "Hooks for retrieving the user's token balance and minting tokens with cache updates.",
  "frontend/src/hooks/useBooks.ts": "React Query hooks for fetching, adding, updating, and uploading content for books using the backend actor.",
  "frontend/src/hooks/useCart.ts": "Hooks to manage the user's cart, including fetching, adding, removing items, checkout, and combining cart data with book info.",
  "frontend/src/hooks/useCatalogTransfer.ts": "Provides mutations to export and import the full catalog state and invalidates related caches.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for managing Internet Identity authentication, login flow, and persisted identities.",
  "frontend/src/hooks/useKyc.ts": "Mutation hook to submit KYC proofs and invalidate cart data on success.",
  "frontend/src/hooks/useLibrary.ts": "Hooks to fetch the user's library of purchased books and retrieve purchased book content or media.",
  "frontend/src/hooks/useOrders.ts": "Hooks for fetching individual orders, user orders, and all orders from the backend.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file for organizing query hooks.",
  "frontend/src/hooks/useResetStore.ts": "Mutation to reset backend store state and invalidate all relevant caches with error handling.",
  "frontend/src/hooks/useSupportChat.ts": "Hooks for sending support messages, fetching user/admin messages, and responding to messages.",
  "frontend/src/index.css": "Tailwind CSS setup defining theme variables for light and dark modes.",
  "frontend/src/lib/utils.ts": "Utility function for merging class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "App entry point setting up React Query and Internet Identity providers before rendering the app.",
  "frontend/src/pages/admin/AdminCatalogPage.tsx": "Admin interface for viewing, filtering, adding, editing, managing media, and deleting books in the catalog.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Main admin dashboard with tabbed navigation to catalog, orders, minting, support, and settings pages.",
  "frontend/src/pages/admin/AdminMintPage.tsx": "Form for admins to mint GLDT tokens to a specified principal using backend minting hooks.",
  "frontend/src/pages/admin/AdminOrdersPage.tsx": "Displays a table of all orders with customer info, items, totals, and dates, using book lookups for item titles.",
  "frontend/src/pages/admin/AdminRecoveryPage.tsx": "Provides admin access recovery flow requiring II login, with success and error handling states.",
  "frontend/src/pages/admin/AdminSettingsPage.tsx": "Admin interface for resetting, exporting, and importing catalog data with file parsing, validation, and confirmation flows.",
  "frontend/src/pages/admin/AdminSupportInboxPage.tsx": "Admin view for browsing support message threads and sending replies with message grouping and refresh handling.",
  "frontend/src/pages/BookDetailsPage.tsx": "Displays detailed book info, handles add-to-cart logic with auth, sold-out, and error states.",
  "frontend/src/pages/CartPage.tsx": "Shows cart contents, supports removing items, validates single-copy issues, and navigates to checkout.",
  "frontend/src/pages/CatalogPage.tsx": "Lists available books with search filtering and loading states.",
  "frontend/src/pages/CheckoutPage.tsx": "Handles checkout flow including balance checks, KYC validation, and order submission.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero section and a featured books preview.",
  "frontend/src/pages/MyLibraryPage.tsx": "Displays purchased books, supports reading and downloading media content.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Displays order confirmation details, fetching order and book info and offering navigation to library or catalog.",
  "frontend/src/pages/PurchaseConfirmationPage.tsx": "Shows a purchase completion message with actions to view the library, order details, or continue shopping.",
  "frontend/src/utils/catalogTransfer.ts": "Utilities for validating, parsing, and merging catalog JSON files, including import mode logic.",
  "frontend/src/utils/download.ts": "Helper functions to trigger file downloads, including JSON and binary data.",
  "frontend/src/utils/format.ts": "Formatting utilities for token amounts, principals, and timestamps.",
  "frontend/src/utils/kyc.ts": "Functions for deriving KYC IDs and validating document numbers.",
  "frontend/src/utils/kycRestrictionErrors.ts": "Detects KYC‑restriction backend errors and maps them to user‑friendly messages.",
  "frontend/src/utils/orderId.ts": "Generates unique order IDs using timestamp and randomness.",
  "frontend/src/utils/principal.ts": "Parses principal strings into Principal objects with error handling.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL and session parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining themes, colors, animations, and plugins.",
  "project_state.json": "Tracks project state for deploying Version 25 to the specified live domain and lists existing features and in-progress requests related to the deployment."
}