{
  "backend/main.mo": "Main Motoko canister defining user profiles, catalog management, carts, orders, KYC data, support messages, and admin‑gated catalog export with mixins for storage and authorization.",
  "feature_evidence.json": "Feature evidence report listing deployment‑related features, affected files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Text file mapping frontend source file paths to short functional summaries for build planning.",
  "frontend/.env.production": "Production environment file setting VITE_APP_ENV to Live for production builds.",
  "frontend/docs/deployment-preflight.md": "Documentation describing the deployment preflight checklist to verify environment config and prevent Live deployment failures.",
  "frontend/index.css": "Tailwind CSS setup defining base styles and CSS variables for light and dark themes.",
  "frontend/index.html": "HTML entry point containing root mount node and script loading the frontend.",
  "frontend/scripts/deployment-preflight.sh": "Bash script performing automated preflight checks for environment config, dependencies, backend build, bindings, and frontend build.",
  "frontend/src/App.tsx": "Main application entry configuring TanStack Router routes, layout, theming, and app providers.",
  "frontend/src/components/admin/BookMediaManager.tsx": "Manages uploading and removing PDF, image, audio, and video files for a book with progress tracking and validation.",
  "frontend/src/components/auth/AdminRoute.tsx": "Protects admin-only routes by checking authentication and admin status, showing appropriate loading or error states.",
  "frontend/src/components/auth/LoginButton.tsx": "Provides a login/logout button using Internet Identity with error handling and query cache clearing.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Prompts newly authenticated users to enter their name and saves the profile before continuing.",
  "frontend/src/components/books/BookCard.tsx": "Displays a book preview card with cover, metadata, pricing badges, and a details link, including sold-out logic.",
  "frontend/src/components/books/CoverImage.tsx": "Renders a static generated cover image with a fallback when loading fails.",
  "frontend/src/components/checkout/KycVerificationCard.tsx": "Handles KYC verification by validating and submitting ID information, showing success or error states.",
  "frontend/src/components/checkout/SelfieCapture.tsx": "Placeholder file with no implemented functionality.",
  "frontend/src/components/EmptyState.tsx": "Reusable UI component showing an empty state with optional icon, description, and action.",
  "frontend/src/components/layout/Footer.tsx": "Shows footer with social links, support chat, and copyright attribution.",
  "frontend/src/components/layout/Header.tsx": "Renders the site header with navigation, user identity info, cart badge, and environment display, using multiple hooks for auth, cart, and balance state.",
  "frontend/src/components/layout/Layout.tsx": "Wraps the app with header, footer, routed content, and profile setup dialog.",
  "frontend/src/components/layout/PageLayout.tsx": "Provides a reusable page container with configurable max width and padding.",
  "frontend/src/components/library/BookContentDialog.tsx": "Displays purchased book content and media in a dialog with loading, error handling, previews, and download support.",
  "frontend/src/components/library/LibraryPdfDownloadButton.tsx": "Offers a button to download a purchased book’s PDF, handling permissions, errors, and toast notifications.",
  "frontend/src/components/support/CustomerServiceChatDialog.tsx": "Implements a customer service chat dialog for submitting questions and viewing threaded support responses.",
  "frontend/src/config/environment.ts": "Normalizes build-time environment variables into a Draft or Live environment flag.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the authenticated or anonymous backend actor and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useAdminRecovery.ts": "Provides a mutation to recover admin access with detailed error mapping and cache invalidation.",
  "frontend/src/hooks/useAuthz.ts": "Hooks for fetching and saving user profiles and checking admin status via the backend actor.",
  "frontend/src/hooks/useBalance.ts": "Hooks for retrieving token balance and minting tokens with automatic cache updates.",
  "frontend/src/hooks/useBooks.ts": "Provides React Query hooks for fetching, adding, updating, and uploading book data via the backend actor.",
  "frontend/src/hooks/useCart.ts": "Implements cart-related queries and mutations including adding, removing, checkout, and computing cart totals with book data.",
  "frontend/src/hooks/useCatalogTransfer.ts": "Exports and imports full catalog state and invalidates related caches after import.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, login, logout, and provides identity through context.",
  "frontend/src/hooks/useKyc.ts": "Submits document-based KYC proofs and handles backend validation responses.",
  "frontend/src/hooks/useLibrary.ts": "Builds the user’s library from orders and books and provides hooks to fetch purchased book content and media.",
  "frontend/src/hooks/useOrders.ts": "Contains hooks for fetching individual, user, and all orders from the backend.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file for organizing query hooks.",
  "frontend/src/hooks/useResetStore.ts": "Provides an admin store-reset mutation and invalidates all major caches with error handling.",
  "frontend/src/hooks/useSupportChat.ts": "Implements support messaging queries and mutations for users and admins with polling.",
  "frontend/src/index.css": "Defines Tailwind base styles and a custom color palette for light and dark themes.",
  "frontend/src/lib/utils.ts": "Utility function for merging Tailwind class names.",
  "frontend/src/main.tsx": "Bootstraps the app with React Query and Internet Identity providers.",
  "frontend/src/pages/admin/AdminCatalogPage.tsx": "Admin interface for listing, adding, editing, and managing books and their media and content.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Top-level admin dashboard with tabs for catalog, orders, minting, support, and settings.",
  "frontend/src/pages/admin/AdminMintPage.tsx": "Form allowing admins to mint GLDT tokens to a specified principal.",
  "frontend/src/pages/admin/AdminOrdersPage.tsx": "Displays all orders with item and customer info for administrative review.",
  "frontend/src/pages/admin/AdminRecoveryPage.tsx": "Provides UI for recovering admin access, including identity sign-in and recovery flow.",
  "frontend/src/pages/admin/AdminSettingsPage.tsx": "Provides admin UI for resetting, exporting, and importing catalog data with file parsing, validation, and confirmation flows.",
  "frontend/src/pages/admin/AdminSupportInboxPage.tsx": "Displays customer support message threads and allows admins to reply, refresh, and view message history.",
  "frontend/src/pages/BookDetailsPage.tsx": "Displays detailed book info with add‑to‑cart logic, sold‑out handling, and identity checks.",
  "frontend/src/pages/CartPage.tsx": "Shows cart items with quantity validation, removal actions, and checkout navigation with auth checks.",
  "frontend/src/pages/CatalogPage.tsx": "Lists all available books with search filtering and loading states.",
  "frontend/src/pages/CheckoutPage.tsx": "Handles checkout flow including balance checks, KYC verification, single‑copy validation, and order submission.",
  "frontend/src/pages/HomePage.tsx": "Renders homepage hero section and a featured books preview pulled from available books.",
  "frontend/src/pages/MyLibraryPage.tsx": "Displays the user’s purchased books with reading, media access, and download options.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Displays order confirmation details, including items, total paid, and navigation to library or catalog.",
  "frontend/src/pages/PurchaseConfirmationPage.tsx": "Shows a purchase success message and provides navigation to library, order details, or catalog.",
  "frontend/src/utils/catalogTransfer.ts": "Validates, parses, and merges catalog export files, supporting overwrite and merge import modes.",
  "frontend/src/utils/download.ts": "Utility functions for downloading files and JSON blobs via browser-triggered downloads.",
  "frontend/src/utils/format.ts": "Provides formatting helpers for token amounts, principals, and dates.",
  "frontend/src/utils/kyc.ts": "Handles deriving KYC identifiers and validating document numbers.",
  "frontend/src/utils/kycRestrictionErrors.ts": "Detects KYC-related backend errors and maps them to friendly user messages.",
  "frontend/src/utils/orderId.ts": "Generates unique order IDs using timestamp and randomness.",
  "frontend/src/utils/principal.ts": "Parses and validates principal strings using the ICP SDK.",
  "frontend/src/utils/urlParams.ts": "Manages URL and session-stored parameters, supporting persistence and hash-based routing.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, typography, animations, and plugin setup for the frontend.",
  "project_state.json": "Tracks project state for fixing a production deployment failure in Version 22, including known issues and existing features. Contains metadata, issue list, and deployment-related tasks."
}