{
  "backend/main.mo": "Main canister implementing book store logic with storage mixins, access control, KYC data, book and order types, and owner recovery functions.",
  "feature_evidence.json": "Feature evidence report describing a homepage hero image update and listing affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of frontend files including pages, components, and admin tooling.",
  "frontend/index.css": "Tailwind CSS base configuration defining theme variables for light and dark modes.",
  "frontend/index.html": "Base HTML document that loads the React application entry point.",
  "frontend/src/App.tsx": "Main React app configuring TanStack Router routes and wrapping the app in theme and toaster providers.",
  "frontend/src/components/admin/BookMediaManager.tsx": "Admin component for uploading, validating, tracking progress, and removing PDF, image, audio, and video media for books.",
  "frontend/src/components/auth/AdminRoute.tsx": "Route guard that checks identity and admin status, showing loading, denial, or recovery options as needed.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with loading handling, error fallback, and session clearing.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Dialog prompting authenticated users without a profile to enter and save their name. Handles form state, validation, and profile save mutation.",
  "frontend/src/components/books/BookCard.tsx": "Displays a book card with cover, title, metadata, badges, and a details button. Shows sold‑out and restriction statuses based on book properties.",
  "frontend/src/components/books/CoverImage.tsx": "Renders a book cover image using a static generated asset with fallback on load error. Wraps the image in a styled container.",
  "frontend/src/components/checkout/KycVerificationCard.tsx": "Handles phone‑OTP and selfie‑based KYC verification, including timers, input validation, and submission flows. Calls a callback when verification completes.",
  "frontend/src/components/checkout/SelfieCapture.tsx": "Provides camera or file‑upload selfie capture with preview, retake, and validation. Uses a custom camera hook to manage photo capture.",
  "frontend/src/components/EmptyState.tsx": "UI component rendering a centered empty-state message with optional icon, description, and action.",
  "frontend/src/components/layout/Footer.tsx": "Footer displaying contact links, a customer service chat dialog, and attribution. Simple static layout with icons.",
  "frontend/src/components/layout/Header.tsx": "Top navigation bar showing logo, links, cart, login, and user balance. Adjusts items based on authentication and admin status.",
  "frontend/src/components/layout/Layout.tsx": "Page shell rendering header, footer, routed content, and the profile setup dialog. Wraps the entire app layout.",
  "frontend/src/components/layout/PageLayout.tsx": "Utility layout component applying max-width and padding to page content. Accepts custom sizing and class names.",
  "frontend/src/components/library/BookContentDialog.tsx": "Displays purchased book content and media in a dialog, handling loading, errors, image expansion, and file downloads. Integrates multiple media types with scrolling and download actions.",
  "frontend/src/components/library/LibraryPdfDownloadButton.tsx": "Provides a button to download a purchased book's PDF, handling authentication, loading state, and error cases. Downloads the file using fetched PDF bytes.",
  "frontend/src/components/support/CustomerServiceChatDialog.tsx": "Implements a customer service chat dialog where users can send messages and view threaded responses. Handles authentication hints, message submission, loading, and grouped message display.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor, refetching dependent queries when identity changes. Initializes admin access if available.",
  "frontend/src/hooks/useAdminRecovery.ts": "Exposes a mutation to recover admin access with clear error mapping and invalidates admin status on success. Requires an authenticated actor.",
  "frontend/src/hooks/useAuthz.ts": "Provides hooks to get, save, and check admin status for the current user's profile using the backend actor. Manages query states tied to authentication.",
  "frontend/src/hooks/useBalance.ts": "Adds hooks for fetching token balance and minting tokens through the backend actor. Invalidates balance queries after minting.",
  "frontend/src/hooks/useBooks.ts": "Contains hooks for fetching, adding, updating, and uploading content for books via the backend actor. Invalidates relevant book queries on mutations.",
  "frontend/src/hooks/useCart.ts": "Implements hooks for fetching and mutating the shopping cart, as well as checkout, with query invalidation on updates. Also derives cart items joined with book data and total cost.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, including login, logout, and loading stored identities.",
  "frontend/src/hooks/useKyc.ts": "Implements hooks for phone-based OTP and facial KYC flows, submitting verification proof through the backend actor.",
  "frontend/src/hooks/useLibrary.ts": "Fetches a user's purchased books and provides hooks to load book content or media through the backend actor.",
  "frontend/src/hooks/useOrders.ts": "Contains hooks for retrieving single, user-specific, and all orders using the backend actor and Internet Identity.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file for organizing query hooks.",
  "frontend/src/hooks/useResetStore.ts": "Defines a mutation to reset backend store data and invalidate related frontend caches, with admin permission checks.",
  "frontend/src/hooks/useSupportChat.ts": "Provides hooks for sending support messages, fetching user/admin message threads, and sending admin replies.",
  "frontend/src/index.css": "Tailwind CSS setup defining light and dark theme variables and global base styles.",
  "frontend/src/lib/utils.ts": "Exports a utility function for merging Tailwind class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Application entry point setting up React Query and Internet Identity providers before rendering the app.",
  "frontend/src/pages/admin/AdminCatalogPage.tsx": "Admin interface for listing, adding, editing, and managing book catalog entries and media.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Main admin dashboard providing tabbed navigation to catalog, orders, minting, support, and settings pages.",
  "frontend/src/pages/admin/AdminMintPage.tsx": "Admin form for minting GLDT tokens to a specified principal.",
  "frontend/src/pages/admin/AdminOrdersPage.tsx": "Shows a table of all customer orders with details, totals, and associated book info.",
  "frontend/src/pages/admin/AdminRecoveryPage.tsx": "Page for recovering admin access using Internet Identity with success and error handling.",
  "frontend/src/pages/admin/AdminSettingsPage.tsx": "Admin settings page allowing full store reset with warnings and confirmation dialog.",
  "frontend/src/pages/admin/AdminSupportInboxPage.tsx": "Renders an admin interface for viewing grouped support message threads and replying to user messages. Uses hooks to fetch inbox data and send responses.",
  "frontend/src/pages/BookDetailsPage.tsx": "Renders detailed book information with add‑to‑cart logic, handling authentication, sold‑out states, and error feedback.",
  "frontend/src/pages/CartPage.tsx": "Page showing cart contents, handling single-copy validation, item removal, and navigating to checkout.",
  "frontend/src/pages/CatalogPage.tsx": "Displays available books with search filtering and loading states.",
  "frontend/src/pages/CheckoutPage.tsx": "Processes checkout with balance checks, KYC flow, error handling, and order submission.",
  "frontend/src/pages/HomePage.tsx": "Homepage with hero section and featured books pulled from the catalog.",
  "frontend/src/pages/MyLibraryPage.tsx": "Shows user's purchased books with reading, media access, and content loading dialogs.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Displays order confirmation details and navigation options after purchase.",
  "frontend/src/pages/PurchaseConfirmationPage.tsx": "Displays purchase confirmation with options to view library, order details, or keep shopping.",
  "frontend/src/utils/download.ts": "Provides helpers to trigger file downloads from raw data blobs or direct URLs.",
  "frontend/src/utils/format.ts": "Includes small formatting utilities for token amounts, principals, and date formatting.",
  "frontend/src/utils/orderId.ts": "Generates an order ID string using a timestamp and random number.",
  "frontend/src/utils/principal.ts": "Parses and validates a principal string using the ICP SDK.",
  "frontend/src/utils/urlParams.ts": "Utility for reading, storing, persisting, and clearing URL parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with custom colors, fonts, animations, and plugins.",
  "project_state.json": "Tracks project state indicating a request to revert the homepage hero image to a previous asset due to a display issue."
}