{
  "backend/main.mo": "Defines the backend actor for book storage, user profiles, carts, orders, KYC mappings, and admin‑gated catalog export.",
  "feature_evidence.json": "Lists feature evidence mapping features to related files, components, and test IDs for traceability.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of many frontend source files for documentation or planning.",
  "frontend/.env.production": "Sets VITE_APP_ENV=Live for production builds to display the Live environment badge.",
  "frontend/docs/deployment-preflight.md": "Describes required checks before deployment and enforces Version 29 for Live publishes with a separate rollback workflow.",
  "frontend/docs/draft-rebuild-v29.md": "Explains how to rebuild Draft Version 29 safely without affecting Live or backend state.",
  "frontend/docs/draft-regression-checks.md": "Provides a checklist to prevent catalog‑visibility regressions and ensure error handling before promoting drafts.",
  "frontend/docs/live-smoke-test-v22.md": "Outlines the Live smoke test procedure for validating Version 22 deployment, media rendering, and purchase flow.",
  "frontend/docs/live-smoke-test-v29-report-template.md": "Template for operators to record results of the Version 29 Live smoke test, including environment checks, catalog validation, book details, and purchase flow.",
  "frontend/docs/live-smoke-test-v29.md": "Manual checklist outlining all verification steps required to validate Version 29 on the Live environment, covering UI, catalog, purchase flow, and admin functions.",
  "frontend/docs/publish-live.md": "Guide describing how to safely publish Version 29 to the Live environment, including strict version lock rules and pre-publish requirements.",
  "frontend/docs/releases/v29-live-publish-execution-log.md": "Execution log documenting the Version 29 Live frontend-only deployment, including validations, build steps, and post-deployment checks.",
  "frontend/docs/releases/v29-live-smoke-test-report.md": "Filled smoke test report template for Version 29 Live validation, containing operator instructions and structured test result fields.",
  "frontend/docs/rollback-to-v35.md": "Emergency frontend-only rollback procedure for deploying Version 35 to restore catalog visibility while preserving backend data.",
  "frontend/index.css": "Tailwind CSS base and theme variables defining color tokens for light and dark mode, plus global styling rules.",
  "frontend/index.html": "Basic HTML entrypoint that mounts the app root and loads the main TypeScript module.",
  "frontend/scripts/deployment-preflight.sh": "Runs frontend-only deployment preflight checks including version enforcement, environment validation, dependency verification, and build tests.",
  "frontend/scripts/enforce-version-29.sh": "Ensures the frontend VERSION file contains exactly '29' and blocks deployment if not.",
  "frontend/scripts/live-smoke-test-v22-helper.sh": "Prints manual smoke‑test checklist and URLs for verifying the Version 22 live deployment.",
  "frontend/scripts/live-smoke-test-v29-helper.sh": "Outputs key URLs and manual verification steps for validating the Version 29 live deployment.",
  "frontend/scripts/publish-live.sh": "Publishes the Version 29 frontend to Live by enforcing version checks, running preflight, and deploying the frontend canister only.",
  "frontend/scripts/rebuild-draft-v29.sh": "Rebuilds the Version 29 frontend in Draft mode by enforcing version, preparing env files, cleaning artifacts, generating bindings, and building.",
  "frontend/scripts/rollback-frontend-v35.sh": "Automates a frontend‑only rollback to version 35, including version update, rebuild, checks, and canister deployment.",
  "frontend/scripts/rollback-preflight.sh": "Runs validation checks before rollback, ensuring VERSION=35 and required files, dependencies, and tools exist.",
  "frontend/src/App.tsx": "Sets up the application router, theme provider, and global layout for all frontend routes.",
  "frontend/src/components/admin/BookMediaManager.tsx": "Admin tool for uploading and removing a book’s PDF, images, audio, and video files with progress tracking.",
  "frontend/src/components/auth/AdminRoute.tsx": "Protects admin pages by checking authentication and admin privileges, showing appropriate warnings and redirects.",
  "frontend/src/components/auth/LoginButton.tsx": "Handles Internet Identity login/logout with UI feedback and query cache reset.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Prompts new authenticated users to enter and save their display name before continuing.",
  "frontend/src/components/books/BookCard.tsx": "Displays a book’s cover, title, metadata, and status badges with links to its details page.",
  "frontend/src/components/books/CoverImage.tsx": "Displays a book cover image using an uploaded blob if available, with multiple fallback sources on load failure.",
  "frontend/src/components/checkout/KycVerificationCard.tsx": "Handles KYC document input, validation, backend submission, and success or error UI for restricted purchases.",
  "frontend/src/components/checkout/SelfieCapture.tsx": "Empty file with no implementation provided.",
  "frontend/src/components/EmptyState.tsx": "Reusable UI component that displays an empty state with optional icon, description, and action.",
  "frontend/src/components/layout/Footer.tsx": "Renders site footer with contact links, attribution, version info, and a customer service chat trigger.",
  "frontend/src/components/layout/Header.tsx": "Builds the main site header with navigation, auth-aware links, environment badge, balance display, and cart button.",
  "frontend/src/components/layout/Layout.tsx": "Wraps page layout with header, footer, main outlet, and a profile setup dialog.",
  "frontend/src/components/layout/PageLayout.tsx": "Provides a configurable max‑width container for page content with optional custom classes.",
  "frontend/src/components/library/BookContentDialog.tsx": "Shows purchased book PDFs and media in a dialog with loading, error handling, previews, and download actions.",
  "frontend/src/components/library/LibraryPdfDownloadButton.tsx": "Allows downloading a purchased book PDF with permission checks, filename sanitization, and user‑friendly errors.",
  "frontend/src/components/support/CustomerServiceChatDialog.tsx": "Implements a chat dialog for submitting support messages and viewing threaded responses with authentication-aware behavior.",
  "frontend/src/config/environment.ts": "Resolves build-time environment from Vite variables, normalizing to Draft or Live and exporting the result.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the user's identity, and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useAdminRecovery.ts": "Provides a mutation to recover admin access with user-friendly error mapping and admin state invalidation.",
  "frontend/src/hooks/useAuthz.ts": "Handles user profile fetch/save operations and checks if the caller is an admin using the backend actor.",
  "frontend/src/hooks/useBalance.ts": "Fetches token balance and provides a mutation to mint tokens, refreshing balance afterward.",
  "frontend/src/hooks/useBooks.ts": "Offers queries and mutations for listing, retrieving, adding, updating, and uploading book data.",
  "frontend/src/hooks/useCart.ts": "Manages cart retrieval, item add/remove, checkout, and computes cart totals with book data.",
  "frontend/src/hooks/useCatalogTransfer.ts": "Exports and imports catalog state and invalidates related caches after import.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity login, logout, and identity loading via AuthClient with context support.",
  "frontend/src/hooks/useKyc.ts": "Submits document-based KYC proofs and updates cart state on success.",
  "frontend/src/hooks/useLibrary.ts": "Builds a user's library from delivered orders and fetches purchased book content or media.",
  "frontend/src/hooks/useOrders.ts": "Provides queries for individual orders, user orders, and all orders through the backend actor.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file; query hooks are defined per feature.",
  "frontend/src/hooks/useResetStore.ts": "Provides a mutation to call actor.resetStore and invalidates related React Query caches, with custom error handling.",
  "frontend/src/hooks/useSupportChat.ts": "Implements support chat hooks for sending messages, fetching user/admin messages, message responses, and replying, with query invalidation.",
  "frontend/src/index.css": "Defines Tailwind CSS base styles and custom color variables for light and dark themes.",
  "frontend/src/lib/utils.ts": "Exports a cn() utility that merges class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Initializes React root, sets up React Query and Internet Identity provider, and renders the App.",
  "frontend/src/pages/admin/AdminCatalogPage.tsx": "Admin interface for viewing, adding, editing, and managing books with filters and media/content dialogs.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin dashboard providing tabbed access to catalog, orders, minting, support, and settings pages.",
  "frontend/src/pages/admin/AdminMintPage.tsx": "Admin form for minting GLDT tokens to a specified principal with validation and toast feedback.",
  "frontend/src/pages/admin/AdminOrdersPage.tsx": "Displays all orders in a table, fetching order and book data and showing item details per order.",
  "frontend/src/pages/admin/AdminRecoveryPage.tsx": "Provides admin access recovery flow using Internet Identity, showing login prompts, success messages, and triggering recovery mutations.",
  "frontend/src/pages/admin/AdminSettingsPage.tsx": "Offers store reset, catalog export, and catalog import tools with file parsing, merge/overwrite modes, and confirmation dialogs.",
  "frontend/src/pages/admin/AdminSupportInboxPage.tsx": "Shows customer support messages grouped into threads and allows admins to reply to messages.",
  "frontend/src/pages/BookDetailsPage.tsx": "Displays detailed information for a selected book with add‑to‑cart logic and loading/error states.",
  "frontend/src/pages/CartPage.tsx": "Shows the user’s cart with book details, handles removal, validates single‑copy issues, and navigates to checkout.",
  "frontend/src/pages/CatalogPage.tsx": "Fetches and displays all books with search filtering, handling loading and error states.",
  "frontend/src/pages/CheckoutPage.tsx": "Manages the checkout flow including balance checks, KYC validation, and submitting the order.",
  "frontend/src/pages/HomePage.tsx": "Landing page showing a hero section and a featured books grid using fetched available books.",
  "frontend/src/pages/MyLibraryPage.tsx": "Displays the user's purchased books with reading and download options, including media badges and content dialog.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Shows confirmation details for a completed order, including purchased items and navigation options.",
  "frontend/src/pages/PurchaseConfirmationPage.tsx": "Generic purchase success screen offering navigation to library, order details, or catalog.",
  "frontend/src/utils/catalogTransfer.ts": "Validates, parses, and merges catalog export files, supporting overwrite and merge import modes.",
  "frontend/src/utils/download.ts": "Provides helpers to download files or JSON data by creating and clicking temporary links.",
  "frontend/src/utils/format.ts": "Includes formatting utilities for token amounts, principals, and timestamps.",
  "frontend/src/utils/kyc.ts": "Generates KYC identifiers and validates document numbers with simple rules.",
  "frontend/src/utils/kycRestrictionErrors.ts": "Detects KYC restriction errors and maps them to user-friendly messages.",
  "frontend/src/utils/orderId.ts": "Generates unique order IDs using timestamps and random numbers.",
  "frontend/src/utils/principal.ts": "Parses principal strings into Principal objects and throws on invalid input.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash routing), persist them in sessionStorage, and clear them from either storage or the URL hash.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, custom colors, fonts, animations, and plugins for typography, container queries, and animations.",
  "frontend/VERSION": "Specifies the current frontend version number (35).",
  "project_state.json": "Defines the project’s state including rollback-related requirements, known issues with draft version 36, and pending feature requests for deployment rollback."
}