{
  "backend/main.mo": "Motoko canister defining catalog, user profiles, orders, carts, KYC data, and admin-export logic with storage and authorization mixins.",
  "feature_evidence.json": "Feature evidence report mapping features to modified files, components used, related tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend files including components, pages, and layouts for reference.",
  "frontend/.env.production": "Production environment file setting VITE_APP_ENV to Live.",
  "frontend/docs/deployment-preflight.md": "Documentation describing Version‑29‑only preflight checks validating environment, dependencies, backend build, and frontend build requirements.",
  "frontend/docs/draft-rebuild-v29.md": "Guide for rebuilding Draft Version 29 safely without deploying or modifying backend state.",
  "frontend/docs/live-smoke-test-v22.md": "Manual verification checklist for validating Live deployment integrity for Version 22.",
  "frontend/docs/live-smoke-test-v29-report-template.md": "Template for recording results of a Version 29 Live smoke test including catalog, purchase flow, and admin checks.",
  "frontend/docs/live-smoke-test-v29.md": "Manual smoke test checklist for Draft 29 covering environment badge, wallet address, catalog, book details, and other core UI verification.",
  "frontend/docs/publish-live.md": "Instructions for publishing frontend Version 29 to Live with strict version enforcement and safety rules.",
  "frontend/index.css": "TailwindCSS configuration defining theme variables, light/dark modes, and base styling rules.",
  "frontend/index.html": "Basic HTML shell loading the frontend root element and main TypeScript entry script.",
  "frontend/scripts/deployment-preflight.sh": "Preflight script validating Version 29, environment config, dependencies, and build success without deploying.",
  "frontend/scripts/enforce-version-29.sh": "Guard script ensuring the frontend VERSION file contains exactly '29' before builds or deployment.",
  "frontend/scripts/live-smoke-test-v22-helper.sh": "Helper script printing Version 22 smoke test checklist and key verification URLs.",
  "frontend/scripts/live-smoke-test-v29-helper.sh": "Helper script printing Draft 29 smoke test checklist, key URLs, and manual verification steps.",
  "frontend/scripts/publish-live.sh": "Publishes frontend Version 29 to the live environment after enforcing version checks and running preflight validation.",
  "frontend/scripts/rebuild-draft-v29.sh": "Rebuilds the Draft environment frontend using Version 29 settings without modifying backend or publishing to live.",
  "frontend/src/App.tsx": "Configures the app’s route tree and wraps the router with theme support and toast notifications.",
  "frontend/src/components/admin/BookMediaManager.tsx": "Admin tool for uploading and removing book media files with progress tracking and type validation.",
  "frontend/src/components/auth/AdminRoute.tsx": "Protects admin pages by checking authentication and admin authorization, showing appropriate alerts or content.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with handling for loading states and errors.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Prompts authenticated users without profiles to enter their name and save their profile.",
  "frontend/src/components/books/BookCard.tsx": "Displays a book card with cover, title, pricing badges, availability indicators, and a link to view details.",
  "frontend/src/components/books/CoverImage.tsx": "Renders a book cover image using an uploaded blob if available, with fallback and error handling.",
  "frontend/src/components/checkout/KycVerificationCard.tsx": "Handles KYC document input, validation, submission, and success state for checkout-restricted items.",
  "frontend/src/components/checkout/SelfieCapture.tsx": "Empty placeholder file with no implementation.",
  "frontend/src/components/EmptyState.tsx": "Reusable empty-state UI component displaying an icon, title, optional description, and action.",
  "frontend/src/components/layout/Footer.tsx": "Shows footer with contact links, attribution, version info, and customer service chat dialog.",
  "frontend/src/components/layout/Header.tsx": "Renders the top navigation bar with branding, links, environment badge, balance, and cart indicator.",
  "frontend/src/components/layout/Layout.tsx": "Wraps the app with header, footer, main content area, and profile setup dialog.",
  "frontend/src/components/layout/PageLayout.tsx": "Provides a configurable max‑width container for page layout with padding.",
  "frontend/src/components/library/BookContentDialog.tsx": "Displays purchased book content and media with loading, error handling, previews, and download actions.",
  "frontend/src/components/library/LibraryPdfDownloadButton.tsx": "Downloads a purchased book's PDF with permission checks, error handling, and loading state.",
  "frontend/src/components/support/CustomerServiceChatDialog.tsx": "Renders a customer support chat dialog allowing users to send messages, view threaded responses, and handle authentication state.",
  "frontend/src/config/environment.ts": "Determines app environment (Draft or Live) based on Vite env variables and exports the resolved value.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the user's identity, refreshing dependent queries when it changes.",
  "frontend/src/hooks/useAdminRecovery.ts": "Provides a mutation to trigger admin access recovery and maps backend errors to friendly messages.",
  "frontend/src/hooks/useAuthz.ts": "Handles fetching and saving the caller's user profile and checking admin status using the backend actor.",
  "frontend/src/hooks/useBalance.ts": "Fetches the user's token balance and provides mutations for minting tokens.",
  "frontend/src/hooks/useBooks.ts": "Provides queries and mutations for listing, retrieving, adding, updating, and uploading content for books.",
  "frontend/src/hooks/useCart.ts": "Manages cart retrieval, item updates, checkout, and derives cart totals with book info.",
  "frontend/src/hooks/useCatalogTransfer.ts": "Exposes mutations to export or import the full catalog and invalidates related caches on import.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity provider and hook for login, logout, and identity lifecycle management.",
  "frontend/src/hooks/useKyc.ts": "Provides a mutation hook to submit document-based KYC proof and invalidate cart data on success.",
  "frontend/src/hooks/useLibrary.ts": "Builds a user's library from delivered orders and fetches purchased book content or media.",
  "frontend/src/hooks/useOrders.ts": "Hooks for fetching a single order, the user's orders, or all orders depending on actor and identity availability.",
  "frontend/src/hooks/useQueries.ts": "Empty file reserved for organizing query hooks.",
  "frontend/src/hooks/useResetStore.ts": "Mutation hook to reset the backend store and invalidate all related caches with admin permission checks.",
  "frontend/src/hooks/useSupportChat.ts": "Hooks for sending support messages, retrieving user/admin chat data, and replying to messages with polling.",
  "frontend/src/index.css": "Tailwind CSS setup defining theme variables, light/dark palettes, and base styling.",
  "frontend/src/lib/utils.ts": "Utility merging Tailwind and className values using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "App entry point initializing React, the query client, identity provider, and global styles.",
  "frontend/src/pages/admin/AdminCatalogPage.tsx": "Provides admin tools to view, filter, add, edit, and manage books and their content/media within the catalog.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Defines the main admin dashboard with tabs for catalog, orders, minting, support, and settings.",
  "frontend/src/pages/admin/AdminMintPage.tsx": "Provides a form for admins to mint GLDT tokens to a specified principal using mutation hooks and form validation.",
  "frontend/src/pages/admin/AdminOrdersPage.tsx": "Displays all orders in a table with customer, items, totals, and dates, fetching data via hooks and rendering book titles per item.",
  "frontend/src/pages/admin/AdminRecoveryPage.tsx": "Handles admin access recovery via Internet Identity login, showing recovery steps, success state, and navigation after completion.",
  "frontend/src/pages/admin/AdminSettingsPage.tsx": "Enables store reset, catalog export, and catalog import with overwrite or merge modes, including file parsing and confirmation flows.",
  "frontend/src/pages/admin/AdminSupportInboxPage.tsx": "Shows support message threads and lets admins reply to customers, grouping messages and supporting refresh and message responses.",
  "frontend/src/pages/BookDetailsPage.tsx": "Book details view allowing add‑to‑cart actions with loading, sold‑out, and error handling states.",
  "frontend/src/pages/CartPage.tsx": "Shopping cart page showing cart items, validations, removal actions, and checkout flow.",
  "frontend/src/pages/CatalogPage.tsx": "Catalog listing page that loads available books and supports title/author search filtering.",
  "frontend/src/pages/CheckoutPage.tsx": "Implements checkout flow including balance checks, KYC handling, and order creation with navigation to confirmation pages.",
  "frontend/src/pages/HomePage.tsx": "Displays the homepage hero section and featured books, fetching available books and linking to catalog and library.",
  "frontend/src/pages/MyLibraryPage.tsx": "Shows the user's purchased books with options to read or download content, handling loading and empty states.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Loads and displays detailed order information including items and total amount, with navigation to library or catalog.",
  "frontend/src/pages/PurchaseConfirmationPage.tsx": "Shows a simple purchase success message and provides links to the library, order details, and catalog.",
  "frontend/src/utils/catalogTransfer.ts": "Validates, parses, and merges catalog export files, supporting overwrite and client-side merge modes for CatalogState objects.",
  "frontend/src/utils/download.ts": "Utility functions to download files or JSON data by creating blobs and triggering browser downloads.",
  "frontend/src/utils/format.ts": "Formatting helpers for token amounts, principal shortening, and converting bigint timestamps to readable dates.",
  "frontend/src/utils/kyc.ts": "Generates KYC identifiers and validates document numbers with basic length and presence checks.",
  "frontend/src/utils/kycRestrictionErrors.ts": "Provides functions to detect KYC-restriction-related purchase errors and map them to a user-friendly message.",
  "frontend/src/utils/orderId.ts": "Generates a unique order ID using a timestamp and random number.",
  "frontend/src/utils/principal.ts": "Parses a principal string into a Principal object and throws an error for invalid formats.",
  "frontend/src/utils/urlParams.ts": "Handles reading, storing, and clearing URL and session parameters, including support for hash-based routing.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with custom colors, typography, container settings, animations, and plugins.",
  "frontend/VERSION": "Version lock file defining the frontend version as 29.",
  "project_state.json": "Defines project state, existing features, versioning constraints, and a request to revert deployment to Version 29 only."
}