{
  "kind": "build_request",
  "title": "Fix production deployment failure and re-deploy Version 22 to live",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Investigate the current “Failed to deploy to production: Deployment error” for Version 22 and apply the minimal code/config changes required so the project can successfully deploy to the Live (production) environment.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "re-do deployment to live"
        ]
      },
      "acceptanceCriteria": [
        "A production/live deployment completes successfully without a deployment error.",
        "The live deployment serves the latest frontend build and the latest backend canister wasm for Version 22.",
        "Any required build-time environment configuration for Live (e.g., VITE_APP_ENV) is correctly set so the header environment badge shows \"Live\" on the live site."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add a developer-facing deployment preflight check (documentation and/or script) that can be run before attempting a Live deployment to catch the specific class of failure that caused the Version 22 production deployment error.",
      "target": "unknown",
      "source": {
        "messageIds": [
          "msg-5",
          "msg-6"
        ],
        "quotes": [
          "🙏 Failed to deploy to production: Deployment error",
          "re-do deployment to live"
        ]
      },
      "acceptanceCriteria": [
        "There is a clear, reproducible preflight procedure (documented in-repo) that validates the build succeeds for frontend and backend before initiating a Live deployment.",
        "If the preflight detects a failure, it reports an actionable error message indicating what to fix before retrying deployment."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo (no additional backend services).",
    "Do not edit files under frontend/src/components/ui or any frontend immutablePaths (compose instead).",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Adding new product features unrelated to deployment.",
    "Changing the draft-vs-live catalog publishing workflow (export/import) beyond what is required to restore successful Live deployment."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}