{
  "kind": "build_request",
  "title": "Revert deployment to Version 29 only (block any other version)",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Revert the deployed application to frontend Version 29 and ensure the deployed build reports Version 29 (no Version 30/31/32 artifacts or labels remain in the deployed output).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "REVERT TO VERSION 29. DON'T CREATE ANOTHER VERSION OTHER THAN VERSION 29"
        ]
      },
      "acceptanceCriteria": [
        "The deployed site is running the frontend corresponding to Version 29.",
        "No user-visible version indicator, deployment metadata, or build artifact references Version 30/31/32."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add hard guards to prevent creating, building, or publishing any frontend version other than 29 in this project’s build/deploy workflow (i.e., fail fast if the version is not exactly 29).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "DON'T CREATE ANOTHER VERSION OTHER THAN VERSION 29"
        ]
      },
      "acceptanceCriteria": [
        "If frontend/VERSION is not exactly `29`, any build/publish workflow halts with an English error message stating that only Version 29 is allowed.",
        "If frontend/VERSION is `29`, Draft rebuild and Live publish workflows proceed normally (no behavior regression)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Ensure Live publish remains frontend-only and does not modify or redeploy the backend canister while reverting/publishing Version 29.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "REVERT TO VERSION 29. DON'T CREATE ANOTHER VERSION OTHER THAN VERSION 29"
        ]
      },
      "acceptanceCriteria": [
        "Live publish actions only deploy the frontend canister; backend canister is not deployed/reinstalled/reset.",
        "Existing backend state (books, orders, users, KYC) is preserved after the revert to Version 29."
      ]
    }
  ],
  "constraints": [
    "Use English for any user-facing text.",
    "Do not create or publish any version other than Version 29.",
    "Frontend immutable paths must not be edited: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui (compose only).",
    "Backend must remain single-actor; only add migration.mo if an existing stable state schema must change."
  ],
  "nonGoals": [
    "Adding new product features unrelated to reverting/locking to Version 29.",
    "Backend schema changes or data migrations (unless strictly required to preserve state during revert)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}