{
  "kind": "build_request",
  "title": "Rollback to Version 35 and restore visibility of previously uploaded books",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Provide an emergency rollback workflow that deploys the previously known-good frontend build (Version 35) so the user can see the books they already uploaded, without deploying/reinstalling/modifying the backend canister or backend state.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "Revert to version 35 I can't see the books i uploaded"
        ]
      },
      "acceptanceCriteria": [
        "A documented, repeatable rollback procedure exists to deploy the Version 35 frontend build to the target environment.",
        "Rollback workflow performs frontend-only deployment and does not run any backend deploy/reinstall/reset commands.",
        "After rollback to Version 35, the Catalog page renders previously uploaded books for the same backend state (no data migration required)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update deployment guardrails so that Live publishing remains strictly locked (as currently enforced), while allowing controlled rollback/testing of older frontend versions (e.g., v35) in Draft or an explicitly designated rollback flow.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "Revert to version 35 I can't see the books i uploaded"
        ]
      },
      "acceptanceCriteria": [
        "Existing Live publish workflow remains blocked unless the approved Live version condition is met (no accidental Live publish of arbitrary versions).",
        "A separate rollback/testing flow can deploy a specified older frontend version without requiring edits that weaken the Live publish safeguards.",
        "Documentation clearly states when to use Live publish vs rollback/testing, including safety warnings about preserving backend state."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Identify and fix the regression introduced in Draft Version 36 that prevents previously uploaded books from being visible in the catalog/library UI, and add a minimal regression check so future drafts cannot ship with the same failure.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "I can't see the books i uploaded"
        ]
      },
      "acceptanceCriteria": [
        "With the latest Draft build (post-fix), the Catalog page shows books that exist in backend state (including those uploaded previously).",
        "Failure states are user-visible (English) and actionable (e.g., if fetching books fails, the UI shows an error instead of silently showing an empty catalog).",
        "A documented manual verification step (or checklist update) is added to confirm: (1) catalog loads, (2) previously uploaded books appear, (3) book details pages open successfully."
      ]
    }
  ],
  "constraints": [
    "Do not deploy, reinstall, reset, stop, or otherwise modify the backend canister/state as part of rollback or publish workflows.",
    "Backend must remain a single Motoko actor (all logic in backend/main.mo). Only add backend/migration.mo if an upgrade requires state migration.",
    "Do not edit files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or anything in frontend/src/components/ui; compose around them instead.",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Implementing a new database or any external storage system.",
    "Adding third-party authentication providers (anything beyond Internet Identity).",
    "Adding real-time features (WebSockets/Socket.io)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}