{
  "kind": "build_request",
  "title": "Publish frontend Version 29 to Live (public site)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-4",
      "text": "Publish the existing frontend Version 29 build to the Live public site using the project’s Version-29-only frontend publish workflow, ensuring the deployment is frontend-only and does not deploy/modify/reinstall the backend canister.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1",
          "msg-2",
          "msg-3",
          "msg-4"
        ],
        "quotes": [
          "Version 33 is ready — would you like it published to your public site now?",
          "yes"
        ]
      },
      "acceptanceCriteria": [
        "The Live publish workflow is executed via the existing script: frontend/scripts/publish-live.sh.",
        "The publish workflow blocks immediately if frontend/VERSION is not exactly '29'.",
        "The publish workflow deploys only the frontend canister to the IC network (dfx deploy frontend --network ic) and does not deploy or reinstall the backend canister.",
        "Preflight checks run successfully as part of the publish process (frontend/scripts/deployment-preflight.sh)."
      ]
    },
    {
      "id": "REQ-5",
      "text": "After publishing, complete the manual Live smoke test checklist for Version 29 against https://radicaleconomist101-h78.caffeine.xyz, focusing on environment badge, version label, catalog browsing, and purchase flow sanity checks.",
      "target": "unknown",
      "source": {
        "messageIds": [
          "msg-1",
          "msg-2",
          "msg-3",
          "msg-4"
        ],
        "quotes": [
          "yes"
        ]
      },
      "acceptanceCriteria": [
        "The Live homepage shows the environment badge as 'Live' (not 'Draft').",
        "The footer displays 'Version 29'.",
        "Catalog page (/catalog) loads and shows books with cover images rendering.",
        "A basic cart/checkout navigation path can be exercised without runtime errors (console checked).",
        "Any failures are captured with URL, expected vs observed, and relevant console errors per the checklist in frontend/docs/live-smoke-test-v29.md."
      ]
    }
  ],
  "constraints": [
    "Frontend version is locked to Version 29 only; frontend/VERSION must contain exactly '29' and any other version must fail fast.",
    "Live publish must be frontend-only; do not deploy, reinstall, reset, or otherwise modify the backend canister or its state.",
    "Do not edit files under frontend/src/components/ui or other immutablePaths listed in SYSTEM_CONTEXT.",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Adding new application features unrelated to publishing Version 29 to Live.",
    "Changing backend schemas, performing migrations, or wiping/modifying existing backend state (books, orders, users, KYC).",
    "Introducing or supporting any frontend version other than 29."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}