{
  "kind": "build_request",
  "title": "Revert (Draft) frontend deployment to Version 35 (frontend-only rollback)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Implement a frontend-only rollback workflow that deploys Draft Version 35 of the app without modifying or deploying the backend canister.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "revert to draft version 35 then since 29 is too much for you"
        ]
      },
      "acceptanceCriteria": [
        "A documented and executable procedure exists to deploy frontend Version 35 in Draft mode.",
        "The procedure explicitly does not run any backend deploy/install/reinstall/stop/delete commands.",
        "Rollback deploy updates only the frontend canister and preserves all backend state."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the user-visible version indicator in the UI footer so that it displays Version 35 after the Draft rollback to Version 35.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "revert to draft version 35"
        ]
      },
      "acceptanceCriteria": [
        "After rolling back to Version 35, the footer displays \"Version 35\" (not \"Version 29\").",
        "No other UI locations display a conflicting version label."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Ensure the Draft Version 35 rollback build displays the environment as Draft (not Live) in the UI environment badge by setting the build-time environment configuration appropriately for the rollback workflow.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "revert to draft version 35"
        ]
      },
      "acceptanceCriteria": [
        "After deploying the rollback build, the app’s environment badge shows \"Draft\".",
        "The Live environment configuration and its Version 29 enforcement workflow remain unchanged and continue to require Version 29 for Live publish."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Extend the existing Version 35 rollback preflight checks to validate that the displayed UI version label matches the rollback target (Version 35) before deploying the frontend canister.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "revert to draft version 35"
        ]
      },
      "acceptanceCriteria": [
        "Running the rollback preflight fails with an English error message if the UI contains a hardcoded version label that is not \"Version 35\".",
        "Running the rollback preflight passes when VERSION is exactly 35 and the UI version label is \"Version 35\"."
      ]
    }
  ],
  "constraints": [
    "Do not deploy, reinstall, stop, delete, or migrate the backend canister as part of the rollback to Draft Version 35.",
    "Do not modify files under frontend/src/components/ui (read-only UI component sources).",
    "Do not change the Live publish guardrails that enforce Version 29 for Live deployments."
  ],
  "nonGoals": [
    "Adding new product features unrelated to the rollback request.",
    "Changing backend data models, authorization, or persisted state.",
    "Publishing Version 35 to Live (this request is specifically for Draft rollback)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}