{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Lock frontend deployment to Version 29 and remove non-29 artifacts",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Ensure the app visibly and verifiably reflects frontend Version 29 only, with no remaining references to Versions 30/31/32.",
      "acceptanceCriteria": [
        "The deployed site is running the frontend corresponding to Version 29.",
        "No user-visible version indicator, deployment metadata, or build artifact references Version 30/31/32."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/layout/Footer.tsx",
          "operation": "modify",
          "description": "Add a small, user-visible version label that explicitly states \"Version 29\" (English) so the deployed UI clearly reports Version 29."
        },
        {
          "path": "frontend/scripts/deployment-preflight.sh",
          "operation": "modify",
          "description": "Add build-output validation checks that (1) fail if compiled artifacts include references to Version 30/31/32 and (2) confirm the compiled artifacts include \"Version 29\" so the deployable build can be verified as Version 29."
        },
        {
          "path": "frontend/scripts/publish-live.sh",
          "operation": "modify",
          "description": "Add a post-build / pre-deploy validation step to scan the deployable build output and fail if any references to Version 30/31/32 exist, ensuring the Live publish output contains only Version 29 labeling."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Fail fast in the build/publish workflow unless frontend/VERSION is exactly 29, preventing any non-29 build or publish.",
      "acceptanceCriteria": [
        "If frontend/VERSION is not exactly `29`, any build/publish workflow halts with an English error message stating that only Version 29 is allowed.",
        "If frontend/VERSION is `29`, Draft rebuild and Live publish workflows proceed normally (no behavior regression)."
      ],
      "file_operations": [
        {
          "path": "frontend/scripts/enforce-version-29.sh",
          "operation": "create",
          "description": "Create a shared guard script that checks frontend/VERSION is exactly \"29\" and exits non-zero with a clear English error stating only Version 29 is allowed."
        },
        {
          "path": "frontend/scripts/publish-live.sh",
          "operation": "modify",
          "description": "Refactor version verification to call the shared enforce-version-29.sh guard and ensure the failure message is explicitly \"Only Version 29 is allowed\" (English)."
        },
        {
          "path": "frontend/scripts/rebuild-draft-v29.sh",
          "operation": "modify",
          "description": "Call the shared enforce-version-29.sh guard at the start so Draft rebuild fails fast unless frontend/VERSION is exactly 29."
        },
        {
          "path": "frontend/scripts/deployment-preflight.sh",
          "operation": "modify",
          "description": "Call the shared enforce-version-29.sh guard early so preflight halts immediately unless frontend/VERSION is exactly 29."
        },
        {
          "path": "frontend/docs/deployment-preflight.md",
          "operation": "modify",
          "description": "Update documentation to state that the workflow hard-blocks any version other than 29 and describe the exact failure condition (frontend/VERSION must be exactly 29)."
        },
        {
          "path": "frontend/docs/publish-live.md",
          "operation": "modify",
          "description": "Update documentation to reflect the hard guard: publishing halts unless frontend/VERSION is exactly 29 and no other version may be created/published."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Keep Live publish frontend-only and ensure the workflow cannot modify or redeploy the backend while reverting/publishing Version 29.",
      "acceptanceCriteria": [
        "Live publish actions only deploy the frontend canister; backend canister is not deployed/reinstalled/reset.",
        "Existing backend state (books, orders, users, KYC) is preserved after the revert to Version 29."
      ],
      "file_operations": [
        {
          "path": "frontend/scripts/publish-live.sh",
          "operation": "modify",
          "description": "Add an explicit safety assertion (and matching English error) that the Live publish procedure performs frontend-only deployment and does not run any command that deploys/reinstalls/resets the backend, keeping the publish command scoped to the frontend canister only."
        },
        {
          "path": "frontend/docs/publish-live.md",
          "operation": "modify",
          "description": "Strengthen the written guardrails to clearly state that Live publish is frontend-only and must not deploy/reinstall/reset the backend, and that backend state must remain preserved during the Version 29 revert/publish."
        }
      ]
    }
  ]
}