{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Restore public catalog visibility and add admin re-enable-by-identifier controls",
  "requirements": [
    {
      "id": "REQ-3",
      "summary": "Add an Admin Settings UI control to re-enable books by pasted identifier and display updated/skipped results with clear success/failure messaging.",
      "acceptanceCriteria": [
        "Admin can paste the identifier text and click a button to run the operation.",
        "On success, the UI displays counts and the matched book IDs/titles that were updated and those skipped (if any).",
        "On failure, the UI shows an error message in English without crashing."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useBooks.ts",
          "operation": "modify",
          "description": "Add a React Query mutation hook (e.g., useReEnableBooksByIdentifier) that calls the backend capability reEnableBooksByIdentifier(identifier) and returns ReEnableBooksResult; invalidate available-books/all-books queries on success so the catalog refreshes. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/admin/ReEnableBooksByIdentifierCard.tsx",
          "operation": "create",
          "description": "Create an admin-only card UI that accepts an identifier string input, calls the new useReEnableBooksByIdentifier mutation, and renders a success summary (updatedCount, updatedBooks list, skippedBooks list) and an English error alert on failure. Use existing AdminRoute authorization gating (from the authorization component’s RBAC flow) via the existing admin dashboard wiring so only admins can access. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/admin/AdminSettingsPage.tsx",
          "operation": "modify",
          "description": "Wire the new ReEnableBooksByIdentifierCard into the Admin Settings page as a new section/card, matching existing Settings page styling (Card/Header/Content, Alerts, Button sizing). Keep all new user-facing text in English. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Fix public catalog visibility by querying only available books using the existing available-books React Query hook.",
      "acceptanceCriteria": [
        "Catalog page uses the available-books query (not the all-books query) for the public browsing experience.",
        "After running re-enable for a book that becomes available=true, refreshing the public catalog shows that book in the list."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/CatalogPage.tsx",
          "operation": "modify",
          "description": "Switch the catalog data source from useGetAllBooks() to useGetAvailableBooks() so the public catalog only displays books marked available=true; keep existing search, loading, and error UI behavior intact."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Ensure new admin settings controls match existing Admin Settings styling and all text is in English.",
      "acceptanceCriteria": [
        "New UI elements visually match existing Admin Settings cards/alerts/buttons (no inconsistent styling).",
        "All new labels, helper text, and messages are in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/ReEnableBooksByIdentifierCard.tsx",
          "operation": "create",
          "description": "Implement the identifier re-enable UI using the same shadcn/ui building blocks already used on AdminSettingsPage (Card, Alert, Label, Input, Button) with consistent spacing/typography/button hierarchy, and ensure all labels/helper text/status messages are English. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/admin/AdminSettingsPage.tsx",
          "operation": "modify",
          "description": "Align the new section’s layout and variants with the existing Admin Settings cards/alerts/buttons (matching className patterns like space-y-4/6, Alert variants, Button size='lg'). Ensure all newly added strings remain English."
        }
      ]
    }
  ]
}