{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Frontend rollback to v35, deployment guardrails, and catalog visibility regression fix",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add a documented, repeatable frontend-only rollback workflow to deploy Version 35 so previously uploaded books are visible again without touching backend state.",
      "acceptanceCriteria": [
        "A documented, repeatable rollback procedure exists to deploy the Version 35 frontend build to the target environment.",
        "Rollback workflow performs frontend-only deployment and does not run any backend deploy/reinstall/reset commands.",
        "After rollback to Version 35, the Catalog page renders previously uploaded books for the same backend state (no data migration required)."
      ],
      "file_operations": [
        {
          "path": "frontend/docs/rollback-to-v35.md",
          "operation": "create",
          "description": "Create rollback documentation for deploying the Version 35 frontend build using a frontend-only procedure (explicitly warn against any backend deploy/reinstall/reset/stop). Include a repeatable sequence that uses the dedicated rollback script and a manual verification checklist focused on catalog visibility and book details navigation."
        },
        {
          "path": "frontend/scripts/rollback-frontend-v35.sh",
          "operation": "create",
          "description": "Create an emergency rollback script that deploys the frontend canister only (no backend commands) and requires explicit confirmation before proceeding. The script must validate that frontend/VERSION is exactly 35 and must print post-deploy verification steps (catalog + book details)."
        },
        {
          "path": "frontend/VERSION",
          "operation": "modify",
          "description": "Update the tracked frontend version to 35 as part of the rollback-to-v35 workflow so builds and UI version labeling align with the deployed rollback build."
        },
        {
          "path": "frontend/src/config/version.ts",
          "operation": "create",
          "description": "Add a small version helper that reads the frontend/VERSION value at build time and exposes a trimmed string for UI display, so the app reflects the rollback version consistently."
        },
        {
          "path": "frontend/src/components/layout/Footer.tsx",
          "operation": "modify",
          "description": "Update the footer version indicator to render the version from the new version helper instead of a hard-coded value, so Version 35 displays correctly after rollback."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Keep Live publish strictly version-locked while adding a separate, safe rollback/testing flow for older frontend versions (e.g., v35) with clear documentation and warnings.",
      "acceptanceCriteria": [
        "Existing Live publish workflow remains blocked unless the approved Live version condition is met (no accidental Live publish of arbitrary versions).",
        "A separate rollback/testing flow can deploy a specified older frontend version without requiring edits that weaken the Live publish safeguards.",
        "Documentation clearly states when to use Live publish vs rollback/testing, including safety warnings about preserving backend state."
      ],
      "file_operations": [
        {
          "path": "frontend/docs/publish-live.md",
          "operation": "modify",
          "description": "Update documentation to explicitly distinguish Live publish (strict version lock) vs rollback/testing (separate flow). Add safety warnings that rollback/testing is frontend-only and must never run backend deploy/reinstall/reset/stop commands."
        },
        {
          "path": "frontend/docs/deployment-preflight.md",
          "operation": "modify",
          "description": "Update preflight documentation to clarify which checks apply to Live publishing vs rollback/testing, and to point to the rollback/testing documentation and script as the only supported emergency rollback path (frontend-only)."
        },
        {
          "path": "frontend/scripts/enforce-version-29.sh",
          "operation": "modify",
          "description": "Preserve Live publish strict locking by making the script messaging more explicit that it is the Live-publish guardrail only, and add guidance in output directing users to the separate rollback/testing flow for older versions (without adding any bypass)."
        },
        {
          "path": "frontend/scripts/rollback-preflight.sh",
          "operation": "create",
          "description": "Create a rollback/testing preflight script that validates the rollback version (e.g., 35) and performs frontend-only build checks relevant to rollback without invoking any backend deploy/reinstall/reset commands."
        },
        {
          "path": "frontend/scripts/rollback-frontend-v35.sh",
          "operation": "modify",
          "description": "Integrate the new rollback-preflight script into the rollback flow, ensure it remains frontend-only, and ensure it cannot be mistaken for the Live publish script (distinct prompts + warnings)."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Fix Draft v36 regression by ensuring the catalog shows previously uploaded books (not silently empty) and add a minimal regression check via user-visible error states and a manual verification checklist update.",
      "acceptanceCriteria": [
        "With the latest Draft build (post-fix), the Catalog page shows books that exist in backend state (including those uploaded previously).",
        "Failure states are user-visible (English) and actionable (e.g., if fetching books fails, the UI shows an error instead of silently showing an empty catalog).",
        "A documented manual verification step (or checklist update) is added to confirm: (1) catalog loads, (2) previously uploaded books appear, (3) book details pages open successfully."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/CatalogPage.tsx",
          "operation": "modify",
          "description": "Fix the catalog visibility regression by switching the catalog query to a books source that includes previously uploaded entries (not only currently-available items), and add explicit error-state rendering (English) so fetch failures do not appear as an empty catalog."
        },
        {
          "path": "frontend/src/hooks/useBooks.ts",
          "operation": "modify",
          "description": "Add a dedicated catalog query hook that fetches all books intended to be visible in the catalog UI (including unavailable/sold-out), and ensure errors propagate in a way the UI can render actionable messages (avoid silently returning an empty array on failures)."
        },
        {
          "path": "frontend/docs/live-smoke-test-v29.md",
          "operation": "modify",
          "description": "Add/update the manual verification checklist items to explicitly confirm: (1) catalog loads, (2) previously uploaded books are visible, (3) at least one book details page opens successfully, and note what to check if the catalog is empty (console errors, connectivity)."
        },
        {
          "path": "frontend/docs/draft-regression-checks.md",
          "operation": "create",
          "description": "Create a minimal draft regression checklist documenting a manual verification step to prevent shipping drafts with a blank/incorrect catalog: catalog loads, previously uploaded books appear, and book details pages open successfully."
        }
      ]
    }
  ]
}