{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Admin recovery and store relaunch/reset (frontend-only wiring)",
  "requirements": [
    {
      "id": "REQ-22",
      "summary": "Expose and handle the one-time admin recovery flow UX so the intended owner can regain /admin access when recovery is available.",
      "acceptanceCriteria": [
        "If the canister has no admin configured (or otherwise indicates it is uninitialized for admin), a logged-in user can complete a one-time recovery flow that assigns their current Internet Identity principal as admin.",
        "Once an admin has been successfully assigned via the recovery flow, subsequent attempts to run the recovery flow are blocked and show an English error message indicating recovery is no longer available.",
        "After successful recovery, navigating to /admin allows access for that recovered admin principal and continues to deny access for non-admin principals.",
        "All user-facing error/status text introduced for this flow is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useAdminRecovery.ts",
          "operation": "create",
          "description": "Add a React Query mutation hook that calls the backend capability for admin recovery and, on success, invalidates the cached admin/authz queries (e.g., ['isAdmin']) so AdminRoute re-evaluates access. Map backend authorization/trap failures into clear English error text for the UI. Use the selected 'authorization' component’s frontend guidance for handling authorization errors and Internet Identity-dependent state; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/auth/AdminRoute.tsx",
          "operation": "modify",
          "description": "Enhance the existing Access Denied state to include a self-serve navigation option to the recovery route when a user is authenticated but not an admin (keep English text). Use TanStack Router navigation/linking from within this guard. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-23",
      "summary": "Add a dedicated admin recovery screen at /admin/recover and route users to it from the admin Access Denied screen.",
      "acceptanceCriteria": [
        "Add a route for an admin recovery page (e.g., /admin/recover) and link to it from the existing Access Denied state shown by the admin route guard.",
        "The recovery page clearly displays the currently authenticated principal (English label text) and provides an action to attempt admin recovery.",
        "If the user is not logged in, the recovery page shows an explicit login call-to-action using the existing Internet Identity login UI components/patterns.",
        "If recovery succeeds, the UI confirms success in English and provides a direct navigation action to /admin."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/admin/AdminRecoveryPage.tsx",
          "operation": "create",
          "description": "Implement the admin recovery page UI: (1) when not authenticated, show an English explanation and reuse the existing LoginButton for a clear login call-to-action; (2) when authenticated, show an English-labeled 'Current principal' value and a button that triggers the recovery mutation (from the new recovery hook); (3) on success, show an English success confirmation and a direct navigation action to /admin; (4) on failure, show an English error message (including the blocked/recovery-unavailable case). Use the selected 'authorization' component’s frontend guidance for Internet Identity and authorization error handling; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Register and wire the /admin/recover route in the TanStack Router route tree, pointing to the new AdminRecoveryPage so it is navigable and not orphaned."
        },
        {
          "path": "frontend/src/components/auth/AdminRoute.tsx",
          "operation": "modify",
          "description": "Wire the Access Denied UI link/button to navigate to /admin/recover so users denied admin access can self-serve recovery when available (English text)."
        }
      ]
    },
    {
      "id": "REQ-24",
      "summary": "Add an admin-only relaunch/reset control in the Admin area with confirmation and UI cache refresh after reset.",
      "acceptanceCriteria": [
        "Expose an admin-only UI action in the Admin area to reset/relaunch the store, calling the existing backend reset capability.",
        "The reset action requires an explicit confirmation step in the UI (English text) to prevent accidental resets.",
        "After a successful reset, the UI shows an English confirmation and the app reflects empty/clean state (e.g., empty catalog, empty orders, empty support threads).",
        "Non-admin users cannot see the reset/relaunch control, and attempts to invoke the reset backend method as non-admin continue to fail."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useResetStore.ts",
          "operation": "create",
          "description": "Create a React Query mutation hook that calls the backend reset capability and, on success, invalidates relevant query caches so the UI refreshes to a clean state (e.g., ['allBooks'], ['availableBooks'], ['cart'], ['allOrders'], ['userOrders'], ['userMessages'], ['adminSupportInbox'], ['balance']). Ensure errors are surfaced with English messaging. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/admin/AdminSettingsPage.tsx",
          "operation": "create",
          "description": "Add an Admin Settings view component (rendered inside the existing Admin dashboard tabs) that contains a clearly labeled 'Reset / Relaunch Store' control with an explicit confirmation step (e.g., shadcn/ui AlertDialog) and English warnings about irreversible deletion of store state. On success, show an English confirmation and provide an optional navigation action (e.g., to /catalog or remain in admin). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/admin/AdminDashboardPage.tsx",
          "operation": "modify",
          "description": "Wire the new settings/reset UI into the existing Admin area by adding a new tab (e.g., 'Settings') and rendering AdminSettingsPage within TabsContent. Keep the control admin-only by virtue of the existing AdminRoute guard."
        }
      ]
    }
  ]
}