{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Frontend-only Live publish workflow for Version 29 + Live smoke test materials",
  "requirements": [
    {
      "id": "REQ-4",
      "summary": "Harden and validate the existing Version-29-only Live frontend publish workflow to deploy frontend only.",
      "acceptanceCriteria": [
        "The Live publish workflow is executed via the existing script: frontend/scripts/publish-live.sh.",
        "The publish workflow blocks immediately if frontend/VERSION is not exactly '29'.",
        "The publish workflow deploys only the frontend canister to the IC network (dfx deploy frontend --network ic) and does not deploy or reinstall the backend canister.",
        "Preflight checks run successfully as part of the publish process (frontend/scripts/deployment-preflight.sh)."
      ],
      "file_operations": [
        {
          "path": "frontend/scripts/publish-live.sh",
          "operation": "modify",
          "description": "Tighten safety checks around the Live publish flow: ensure the script fails fast before any deploy action if the Version-29 guard fails; add explicit safeguards that prohibit any backend deploy/reinstall commands during this workflow and keep the deploy action strictly limited to deploying the frontend canister to the IC network."
        },
        {
          "path": "frontend/scripts/deployment-preflight.sh",
          "operation": "modify",
          "description": "Align preflight output with the Live publish acceptance criteria by clearly asserting the workflow is frontend-only for deployment purposes, and ensure the Version-29 enforcement remains the first gating step before other preflight actions run."
        },
        {
          "path": "frontend/scripts/enforce-version-29.sh",
          "operation": "modify",
          "description": "Confirm the guard blocks immediately when frontend/VERSION is not exactly '29' (including whitespace/newline edge cases), and keep messaging unambiguous that no other version is permitted."
        },
        {
          "path": "frontend/docs/publish-live.md",
          "operation": "modify",
          "description": "Update Live publish documentation to reflect the exact required workflow: running frontend/scripts/publish-live.sh, strict Version 29 enforcement via frontend/VERSION, and explicitly frontend-only deployment that must not deploy/modify/reinstall the backend canister."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Update the Version 29 Live smoke test checklist and helper materials to support manual post-publish verification on the Live site.",
      "acceptanceCriteria": [
        "The Live homepage shows the environment badge as 'Live' (not 'Draft').",
        "The footer displays 'Version 29'.",
        "Catalog page (/catalog) loads and shows books with cover images rendering.",
        "A basic cart/checkout navigation path can be exercised without runtime errors (console checked).",
        "Any failures are captured with URL, expected vs observed, and relevant console errors per the checklist in frontend/docs/live-smoke-test-v29.md."
      ],
      "file_operations": [
        {
          "path": "frontend/docs/live-smoke-test-v29.md",
          "operation": "modify",
          "description": "Revise the checklist to be explicitly for Live Version 29 (not 'Draft 29'), and ensure it prominently covers the required smoke test focus areas: environment badge 'Live', footer 'Version 29', catalog browsing with cover images rendering, and cart/checkout navigation sanity checks with explicit instructions to check the browser console and record failures (URL, expected vs observed, console errors)."
        },
        {
          "path": "frontend/scripts/live-smoke-test-v29-helper.sh",
          "operation": "modify",
          "description": "Update helper script headings and printed steps to match the Live Version 29 smoke test focus (environment badge, version label, catalog covers, checkout navigation without runtime errors) and ensure it points testers to frontend/docs/live-smoke-test-v29.md and the Live URL."
        },
        {
          "path": "frontend/docs/live-smoke-test-v29-report-template.md",
          "operation": "modify",
          "description": "Update report template naming and prompts to match Live Version 29 (remove 'Draft 29' wording where it causes confusion) and ensure it includes fields for capturing failures with URL, expected vs observed, and relevant console errors consistent with frontend/docs/live-smoke-test-v29.md."
        }
      ]
    }
  ]
}