{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "Project involves a KYC-restricted purchasing flow with rules limiting what a verified person (by ID/birth certificate number) can buy over time.",
  "architectural_notes": [
    "Enforce KYC restriction based on persistent person identifier (ID number / birth certificate number) across all KYC-restricted items, not per-item purchase history."
  ],
  "known_issues": [],
  "isFixRequest": false,
  "existing_features": [
    {
      "id": "feature-update-user-facing-kyc-explanatory-text-in-the-checkout-kyc-ui-to-reflect-the-new-policy-no-longer-claiming-it-enforces-one-copy-per-person-for-a-specific-book",
      "title": "Update user-facing KYC explanatory text in the checkout KYC UI to reflect the new policy (no longer claiming it enforces \"one copy per person\" for a specific book).",
      "reqIds": [
        "REQ-3"
      ],
      "version": 1
    },
    {
      "id": "feature-update-frontend-checkout-error-mapping-to-show-a-user-friendly-english-message-that-matches-the-new-backend-restriction-when-the-backend-rejects-checkout-due-to-the-previously-purchased-another-kyc-restricted-item-rule",
      "title": "Update frontend checkout error mapping to show a user-friendly English message that matches the new backend restriction when the backend rejects checkout due to the \"previously purchased another KYC-restricted item\" rule.",
      "reqIds": [
        "REQ-4"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Change KYC purchase restriction: instead of preventing the same person from buying the same item twice, prevent a person (identified by previously entered ID/birth certificate number) from purchasing any other KYC-restricted items at any time after purchasing one KYC-restricted item.",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-2",
      "summary": "Replace the current KYC purchase restriction rule (which prevents a person from purchasing the same KYC-restricted item twice) with a new rule: once a person (identified by the previously submitted KYC identifier derived from ID number or birth certificate number) has purchased any KYC-restricted book, that same KYC identifier must be blocked from purchasing any other KYC-restricted books at any time in the future.",
      "reqIds": [
        "REQ-1"
      ],
      "status": "pending"
    },
    {
      "id": "AR-3",
      "summary": "Update any backend-side pre-checks that currently look for \"already purchased this KYC-restricted book\" to instead detect whether the same KYC identifier has previously purchased a different KYC-restricted book, and block accordingly while leaving non-KYC-restricted purchases unaffected.",
      "reqIds": [
        "REQ-2"
      ],
      "status": "pending"
    }
  ],
  "projectName": "Update KYC purchase restriction to block buying other KYC-restricted items after first KYC-restricted purchase",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}