{
  "kind": "spec_vs_diff_report",
  "version": "1.0",
  "generatedAt": "2026-02-11T00:35:28.877Z",
  "summary": "The diff adds Version-29 enforcement scripts and documentation, and updates the footer to display “Version 29”. However, it also includes unrequested backend code changes and additional frontend UI/attribution changes. Evidence is insufficient to confirm that Live publish is truly frontend-only (no backend deploy) and that all Version 30/31/32 artifacts/labels have been fully removed from the deployed output.",
  "missing_requirements": [
    {
      "id": "REQ-1",
      "requirement": "Revert the deployed application to frontend Version 29 and ensure the deployed build reports Version 29 with no Version 30/31/32 artifacts or labels remaining in deployed output.",
      "reason": "The diff shows adding a visible “Version 29” label and adding checks in scripts/docs, but does not show removal/reversion of any existing Version 30/31/32 labels/artifacts in code or build configuration. There is also no clear evidence in the diff of reverting the actual deployed frontend bundle to the Version 29 codebase (only guards/docs/scripts are shown).",
      "evidence": [
        "frontend/src/components/layout/Footer.tsx",
        "frontend/docs/deployment-preflight.md",
        "frontend/scripts/deployment-preflight.sh",
        "frontend-file-summaries.txt"
      ]
    },
    {
      "id": "REQ-3",
      "requirement": "Ensure Live publish remains frontend-only and does not modify or redeploy the backend canister while reverting/publishing Version 29.",
      "reason": "Although scripts/docs state the workflow is frontend-only, the provided diff for the publish script is truncated before any deploy commands. There is not enough evidence to confirm the Live publish action only deploys the frontend canister and never deploys/reinstalls the backend.",
      "evidence": [
        "frontend/scripts/publish-live.sh",
        "frontend/docs/publish-live.md",
        "frontend/scripts/deployment-preflight.sh"
      ]
    }
  ],
  "hallucinated_features": [
    {
      "description": "Backend canister code changes including new/expanded state types and an admin-only exportCatalog workflow.",
      "reason": "BuildRequest explicitly focuses on reverting/locking the frontend to Version 29 and keeping backend unchanged (no schema changes/migrations unless strictly required). The diff modifies backend/main.mo substantially, which is not requested and risks violating the non-goal of avoiding backend changes.",
      "evidence": [
        "backend/main.mo"
      ]
    },
    {
      "description": "Footer changes beyond version display: social links (X/OpenChat), customer service chat dialog, and caffeine.ai attribution with UTM tracking using window.location.hostname.",
      "reason": "These are new/changed user-facing features unrelated to reverting/locking to Version 29. Only a Version 29 report/label is within scope; the additional footer content is not requested.",
      "evidence": [
        "frontend/src/components/layout/Footer.tsx"
      ]
    },
    {
      "description": "Creation of project_state.json tracking AR-* requests.",
      "reason": "Not requested by the BuildRequest; it appears to be meta/project tracking rather than implementing version revert/guards.",
      "evidence": [
        "project_state.json"
      ]
    }
  ],
  "confidence": 0.62,
  "changed_files": [
    "backend/main.mo",
    "frontend-file-summaries.txt",
    "frontend/docs/deployment-preflight.md",
    "frontend/docs/publish-live.md",
    "frontend/scripts/deployment-preflight.sh",
    "frontend/scripts/enforce-version-29.sh",
    "frontend/scripts/publish-live.sh",
    "frontend/scripts/rebuild-draft-v29.sh",
    "frontend/src/components/layout/Footer.tsx",
    "project_state.json"
  ]
}